{
  "id": "IBM_3414519",
  "participant": [
    {
      "name": "Olympia McNerney",
      "description": "executive",
      "role": "executive"
    },
    {
      "name": "Arvind Krishna",
      "description": "executive",
      "role": "executive"
    },
    {
      "name": "Matt Hicks",
      "description": "executive",
      "role": "executive"
    },
    {
      "name": "Ritika Gunnar",
      "description": "executive",
      "role": "executive"
    },
    {
      "name": "Robert Thomas",
      "description": "executive",
      "role": "executive"
    },
    {
      "name": "Mohamad Ali",
      "description": "executive",
      "role": "executive"
    },
    {
      "name": "Ric Lewis",
      "description": "executive",
      "role": "executive"
    },
    {
      "name": "Jay Gambetta",
      "description": "executive",
      "role": "executive"
    },
    {
      "name": "James Kavanaugh",
      "description": "executive",
      "role": "executive"
    },
    {
      "name": "Matthew Swanson",
      "description": "analyst",
      "role": "analyst"
    },
    {
      "name": "James Schneider",
      "description": "analyst",
      "role": "analyst"
    },
    {
      "name": "Amit Daryanani",
      "description": "analyst",
      "role": "analyst"
    },
    {
      "name": "Benjamin Reitzes",
      "description": "analyst",
      "role": "analyst"
    },
    {
      "name": "Wamsi Mohan",
      "description": "analyst",
      "role": "analyst"
    },
    {
      "name": "Erik Woodring",
      "description": "analyst",
      "role": "analyst"
    },
    {
      "name": "Brian Essex",
      "description": "analyst",
      "role": "analyst"
    },
    {
      "name": "Daniel Zhu",
      "description": "analyst",
      "role": "analyst"
    }
  ],
  "quarter": 0,
  "symbol": "IBM",
  "time": "2025-02-04 18:01:00",
  "title": "Analyst/Investor Day - International Business Machines Corporation",
  "transcript": [
    {
      "name": "Olympia McNerney",
      "speech": [
        "Okay. Okay. Perfect. Thank you, everyone, for joining us today. We're really excited to have you here. We've got a great agenda put to together for you. You can see it on the screen. We'll have Arvind up here first. We're going to talk about our AI strategy with Matt and Ritika. Rob is going to talk about Software, Mohamad, Consulting, Ric, Infrastructure. We'll take a quick break. Jay is going to go through Quantum, and then Jim is going to get to the financial model.\r\nWe're going to ask you to hold your Q&A until the end. We're going to have a dedicated Q&A session. And then after our presentation ends, we've got a great reception for you on the second floor. We've got product demos. We've got cocktails, and we have just the opportunity for you to catch up informally with our entire executive leadership team.\r\nI would ask you to read through our forward-looking statements and non-GAAP information.\r\nAnd with that, I will turn it over to Arvind."
      ],
      "session": "management_discussion"
    },
    {
      "name": "Arvind Krishna",
      "speech": [
        "Thank you, Olivia. Good afternoon, everyone. First, thank you all for coming. Thank you for showing interest. It's really exciting to us. And I thought I'd begin a little bit by talking about a very quick scorecard of where we have been, but then really get into where we are going and all the areas that we are investing in. And in addition to the investment, talk about other changes that we are making inside the business. I think that will be a good setup for all the people following me, and you'll see a touch on a lot of our investments we're making, whether in AI, whether in Software, I'll touch on our M&A strategy. And then a lot of us, as we get through all this, while I'll give you some sense of where we are. And then as Olympia said, Jim will close it all up in terms of putting it all together in terms of an overall model.\r\nSo look, first, I want to begin with sort of how important IBM is and how we work with all of our clients. There was a lot of questions when we talked about hybrid cloud 6, 7 years ago. Many people thought maybe a singular public cloud is enough. But if I look at where we are today, 93% of the Fortune 500 is leveraging our capabilities, and it has perhaps become almost, I'll call it, the conventional wisdom. People are going to use multiple public. People are going to use their private. People are going to use SaaS and kind of how do you operate about all of that.\r\nAt the end of the fourth quarter, we talked about inception to date, by the way, that's 6 quarters. That's not some multiyear phenomenon. We have $5 billion in our AI book of business, about 80% in Consulting and about 20% in Software. So I think that's a pretty strong mark of how far we have come on driving AI as a business.\r\nAnd then if we look at the integrated value, about 80% of our revenue comes from clients who purchase across our entire portfolio. They tend to purchase across Software, across Consulting and Infrastructure. I think that speaks a lot to the power of the efficiency of the enterprise and how there is a flywheel. When we land one, we tend to land all three for about 80% of the time. So I think that speaks very powerfully to our business model.\r\nJust a quick summary on 2024, and then I promise you no more numbers about 2024. So we closed the year with $63 billion of revenue, and $12.7 billion of free cash flow. A lot of you had questions about are you guys going to be able to hit because we began the year, I'll remind you, by saying about $12 billion. And the estimates, I think we're sitting in the high 11s. And as we went through the year, we pretty much kept increasing our conviction and confidence on the cash flow number.\r\nThat speaks a lot actually to our business model about how we're actually getting productivity out of it, about how focused we are in terms of where we are spending our cost and expense in the areas which bring the maximum value, much more in our R&D, much more in client-facing skills, and we are really making the enterprise a lot, lot more efficient as we go along.\r\nWe pretty much met the revenue growth target across all of our segments. I'd say Software outperformed, ending the year at 11% growth, but over the year in the high single digits. Consulting from what we said, it performed kind of in line because we said low single digits, and we did 1%. However, I would tell you that, that probably is an area where we can improve going forward. If I look at it over a 3-year period, right in line. And Infrastructure actually did better than we would expect at the end of a product cycle, and we're going to have a lot more product coming mid this year, so we see that going on.\r\nWe already touched on profitability and cash flow. And a number that doesn't get that much visibility, if I look at our free cash flow as a percentage of revenue, this is the highest we have had that we can look at going backwards. So we look backwards, I think, for 25 or 30 years, and we have not crossed this number. And Jim will touch a bit more on that as well I as we go forward.\r\nSo let's talk a little bit about our flywheel. I want to begin with something that we take a lot of pride in. I always tell our team internally, it all begins and ends with clients. You have to earn clients' trust. You have to delight clients. If you delight clients and you give them innovation, they will tend to buy more from you, and that becomes a flywheel.\r\nSo I begin with that because that is the strength we have. We have hundreds of client relationships, which are incredibly rich, incredibly deep, and we are really, really focused on those clients. And then we have 30,000, 40,000, 50,000 more where it tends to be much more in one part of the business than necessarily all. But that client trust is core to our belief, and it is those clients who power a lot of our business.\r\nWe have leadership in hybrid cloud and artificial intelligence. And I'm going to come back and spell this out a lot more in the next few pages. Given that, we are not just resting on that. We invest a huge amount in innovation, and that is to go drive the growth in the platforms that we are selecting. We have incredible domain expertise. We kind of understand if you're a retailer, what do you need to be able to get more efficiency? If you're a CPG player, what do you need to do to be able to acquire more or create more brands? We bring all that domain expertise to bear through our Consulting arm for our clients, and that is something that they depend upon.\r\nAnd that becomes a multiplier. Where we have more Consulting, we tend to have more Software and Infrastructure. Where we have more Software, it gives the ability for our Consulting colleagues to be able to land better. And I'll touch on an example in the next 10 minutes or so.\r\nAnd then lastly, it's not just our own Consulting. We have a very large ecosystem multiplier, where there is other partners, be it the hyperscalers, there's other partners who are ISVs. There's partners who are resellers. There are other partners who are right on top of us. So there's a lot of ecosystem players who, as their footprint increases, it means our footprint increases. As our footprint increases, it gives them an ability to get revenue for themselves. So that is why that is synergistic.\r\nI often jokingly tell our partner colleagues, it's kind of a win-win-win. It's a win for our partner, it's a win for our client, and it's a win for us. It's not a zero-sum game. It's an ability to expand the pie, so everybody gets a bit more, and that's important. And this goes all the way back to client trust, and hence, we call it the flywheel that is really, really important.\r\nSo let's touch on hybrid cloud. So 73% of companies, this is a wide scope survey use hybrid cloud today. We think in total, when we look at this, there's going to be 1 billion new applications over the next 4 years. If you look at those 1 billion-plus applications that tend to largely run on a hybrid cloud environment. When we look at AI, there's $4.4 trillion in annual productivity gains that are expected. By the way, if I extrapolate from our own numbers, I would tell you that that's likely an underestimate. I actually don't think that's an overestimate.\r\nAnd the reason I say that is very simple for you to think of it this way. Do you think there's going to be at least 5% productivity gains for everybody on the globe coming from it? When you have a $120 trillion economy, 5%, by the way, is already at $6 trillion. So I don't think that those are outlandish numbers. We are going to see those.\r\nAnd if you look at the intersection between hybrid, for us, I'll paraphrase that as containers and AI, 3/4 of AI will run on containers, which we think gives us another tailwind for the Red Hat portfolio and for all the pieces they're in, and Matt will touch on that a little bit as we go on. So I think that we are well positioned to be able to take advantage of both those tailwinds both on hybrid and on AI and being in the right spot with the leading platform is going to help us propel our Software and our Consulting forward as we keep going.\r\nSo if you think about technology, I have claimed that technology will grow faster than GDP. And the reason is that technology is becoming the enabler of growth. If you think about all the headwinds that are there around getting skilled people, around interest rates, around supply chains, technology allows you to grow. And so people -- all of our clients are very focused can I grow the business by leveraging technology as opposed to by adding either physical capital or more human labor into the business. And you can see that the reward in the market come for people who are able to do that. So that's number one.",
        "Second, technology can be used to create incredible operational efficiency inside the business. How do you take cost out? How do you do things, which I call, a number of you come from the financial industry, straight through processing is something which has enabled a huge amount. I think 30 years ago when people did check processing and how much of that has now moved into pure technology. So operational efficiency is going to come and chip away at every enterprise process that is there. And so it's an enabler of profitability, which you can feed back into driving more growth whether it's through new innovation or whether it's through more market access, or geo expansion or any other of those abilities.\r\nStrategic flexibility. How do you begin to decide, do I run this application on a particular cloud? Do I move it to another one? Do I need to, for sovereignty, keep it inside our own place? And so those are all the places.\r\nSorry for the noise above, there's construction on the floor above. It's still a building. I think we are the only tenant in yet. So others are in the process of moving in.\r\nIf I look at our solutions, we want to kind of simplify it. So here are the areas where we believe that we are absolutely leading. If I think about a hybrid cloud, and I'll show you some statistics on the next few pages, you'll see why not just that we believe, but we are the leader. And absolutely, you see the Red Hat logo. That's because that part of the portfolio is anchored in Red Hat.\r\nWhen we think about automation, and by automation, we really mean how do you optimize for complexity and cost? How do you look at your IT infrastructure and decide where it should run? How do you know that you're deploying it and getting fit-for-purpose deployment? How do you know you're getting the lowest cost for all of that? The portfolio we have built, and Rob is going to touch a bit on that, we absolutely believe that, that is something which every one of our client needs, and we see that in the underlying growth.\r\nGetting data ready for AI. Really try to simplify complexity and leverage AI recursively is an important part of what we do in our data portfolio. And you'll hear Ritika, when she comes up with Matt, talked a little bit on that.\r\nThe domain expertise I touched on, whether it's helping our clients in the financial industry, whether it's in insurance, whether it's in retail, CPG, industrial, auto, we bring a lot of domain expertise through our consulting colleagues because that is kind of why people come to us and leverage a lot of our consulting expertise. And that's how we get it deployed, whether for AI or for SAP or for Salesforce or for driving workloads out of the hyperscalers, and that's a very, very powerful engine for us.\r\nAnd a couple of you ahead were asking about Transaction Processing and the mainframe. That really supports the most critical workloads. Ric's going to touch quite a bit more on that, including when people think about it, it's not static. You add more and more capability, so the platform can actually do more and more for our clients over time. And that is one of the big reasons it's been sticky. It's not the same mainframe from 30 years ago. It does a lot more, and it does it in a way that is incredibly cost effective. And I've said that for above a certain volume, it is the most cost-effective platform that there is.\r\nSo if we think about now the proof point on hybrid, if you think about the opportunity on hybrid cloud, when we look at that all in, so that is an all-in number across Infrastructure, across Software, across Consulting, it's a $1.7 trillion opportunity.\r\nBut what I take a lot of pride in is our execution over the past 5 years. So Red Hat has about doubled, we can say a bit more since we acquired it. I don't remember the date exactly, but it may be something like July 9 of 2019 that we closed the acquisition. So right on a bit over 5 years and a bit more than double on total revenue. If I look at the platform, that is where I think we've really shown. We saw what could happen with OpenShift and Ansible.\r\nThe OpenShift platform, over 13x larger now, it was a little over $100 million at that time, and now it's a $1.4 billion in ARR. So that tells you what we're capable of doing on execution and leveraging our global go-to-market engine.\r\nAnsible revenue, about 8x bigger, and I think it has a lot more to go. And it is -- fits in really well with that automation portfolio that is there because it creates run books and really helps automate how people deploy infrastructure.\r\nAnd talking about the flywheel and $16 billion in our own Consulting signings, not counting the others, on top of the Red Hat portfolio, that's driven for our Consulting business. So I think that gives you a pretty good sense of both the momentum, but why we are convinced that we have the leading platform around hybrid cloud.\r\nWhen we used to talk about AI, until about 2 weeks ago, people would question, are you sure that people need smaller models? Is it really possible to be more cost efficient? But I'll go a little bit tongue and cheek, and I'll say with the news that came out around what DeepSeek did, suddenly that debate seems to be over. I'm glad. I don't have any negative feelings there. I think it's great. There's a proof point.\r\nWe think that model should be open because that really allows for rapid innovation. Open doesn't come at the cost of saying no proprietary. But to me, there's a world of both. And the reason open is important is when a client wants to add their own data to refine a model for themselves, they need to have some protection around what is the IP of the underlying model, and can they keep then the refined model to themselves.\r\nCost efficient. How much infrastructure do you need? Is it -- do you need $1 billion of infrastructure to do anything? Or can you do it on a few tens of millions? Then how about running it? Is it going to cost you fractions of cents? Or is it going to cost you fractions of dollars? That's 100x different. And so that's really important, I think, for total volume of usage as we go forward.\r\nHybrid environment, do I have to come back to a very large cloud? I'll sort of go tongue and cheek because some people talked about this. We don't need to say who. Do we need a data center the size of Manhattan, to be able to process what we do? Or can we do it if you think about sovereignty in every country who wants to go deploy these things?\r\nAnd lastly, domain expertise. At the end of the day, the value of AI lies in deploying all of this for the purpose of an enterprise or a government. So we bring those skills. And I'll touch a little bit on some of these elements as we go forward.\r\nSo if we think about our portfolio, we absolutely have to leverage infrastructure. Let's be upfront. The infrastructure we use to train models and to run it is what you would expect, majority is NVIDIA today. There is Smart Ring of AMD, and Intel in there. There's a lot of other players who have small things, mostly for inference, I would say. But for training, what I just mentioned is largely the infrastructure.\r\nBut a lot of this infrastructure also sits together with other servers where the data is. And when we get to inferencing, and you'll hear Ric touch on this a lot more, there's a lot of things you can do to bring the power of inferencing closer and closer to the transaction and to the transaction processing.\r\nThen in storage, you got to get data more and more ready for AI. And that's another big opportunity we think is there going forward.\r\nYou see the hybrid cloud AI tools, you'll hear Matt touch on this a little bit. The reason we call it out in red is because for us, that's our internal code for it's a Red Hat branded product as opposed to an IBM branded product. And what we're doing in RHEL AI and OpenShift AI is something we are very proud of, including all -- one of our latest acquisitions of Neural Magic, which fits right into RHEL AI.\r\nThe data services, and you'll hear Ritika talk about what we're doing there so that we can begin to really infuse both public and private data. We train models. We are very proud of our Granite family of models. Those have fit in the what I would call small. Though it's only in the latest 2 years that something at 10 billion parameters is considered small. Long -- not very long ago, that would have been considered extremely large. So -- but it's all relative. And so we kind of focus in that sort of 3 billion to 100 billion parameters is kind of where we are focused for the models that we give back to our clients.\r\nAI middleware. You got to think about all the capabilities. How do you run the models? How do you keep your life cycle? How do you worry about all of the monitoring, all of the -- how well are they doing? All of those aspects of middleware always is an area that we are focused on.",
        "And lastly, you go all the way up to do you begin to package it up together as an AI assistant and agent. A great example is what we are doing with mainframe modernization. We take that stack below, and then we say, okay, we are very good at producing models that are good for understanding programming languages and English, both. So can I take something written in COBOL? Can we understand it? Can you say you want to rewrite it? Can we begin to document it for you? Can we rewrite it for our client and help them modernize their mainframe stack?\r\nYou can stay in COBOL, if that's where you want to go or you can go all the way to Java. And really, you get a full-blown assistant that really helps the human take that task on and go ahead and do it. So really, that's an example of what we're doing there, and we work with everybody. So we work and really, when we say open, it's inherent to this model. We have our own models, but we work with others also, Mistral, Hugging Face, Llama are simple examples. We work on all the public clouds. That's another example. We work with the various chip providers. You heard me talk about that, but also the system integrators, the SaaS partners, our models are embedded, be it in SAP, in ServiceNow, in Salesforce, there's a number of places where we're embedding our models and hundreds of other players, is sort of what we are building out over here as we go along.\r\nAnd Consulting has really trained tens of thousands of people who can come and do these projects for our clients, and you see that in the book of business that we just touched on.\r\nIf you look at that book of business, we're incredibly pleased with our progress here. I'll always accept, we can keep doing more and we will keep doing more. But if you look at it, we began on the order of $100 million to $200 million. We kind of doubled last year, going to the third to the fourth. We began to talk about the book of business is reaching the billions. And then the last quarter, we increased it by $2 billion from quarter-to-quarter, from the third to the fourth quarter.\r\nSo it gives you a sense of how well our clients are accepting this and how well they are signing, about 80% in Consulting bookings and about 20% in Software business so far. So that gives you a very good sense of how well the business is proceeding on the dimensions that I showed you on the prior page.\r\nIt always comes to life when you talk about clients. So let's take Delta Air Lines. So Delta a few years ago, by the way, at the heart of the pandemic, said, we want to use this time when workload is low to do a big migration. After a lot of debate, that was their decision. We were helping, maybe advising but it was their decision. They were going to pick AWS as the cloud of their destination.\r\nThey picked our consulting team to help them on their migration. Then they immediately said, hey, but I need some flexibility. Maybe I'll stay on AWS, but I want the option maybe that I could go somewhere else. So with consulting in AWS, then they pick the Red Hat OpenShift Foundation as a way that they are going to do that migration.\r\nThen they said, how about helping us on data management? How about helping us on application modernization? How about rethinking what a booking experience should be? How about rethinking how we begin to do crew scheduling and planning? So as you begin to do that flywheel, you begin from one, which was our consulting team's expertise in helping migrate to cloud. Then you go and you add the hybrid portfolio in there. Then you go add the data portfolio in there. And I think that's a great story, but driven as Delta would always talk about, driven with their focus in mind that they want to have the best experience for their clients at the end of the day.\r\nExxonMobil really began by saying that they want to have the best experience on digital payments because when you have 100 million customers going up to their retail stores and beginning to do, how do you improve that experience? As you begin to do that, then they realize the container-based architecture is the best architecture for them, and how do you have the best app dev environment on that.\r\nAnd one, where there isn't that much a transaction. So the Masters, which is a golf tournament, and this will surprise you, comes to us and say, we want to have the best experience for our fans. I'll use that word, for the fans, the spectators on the mobile app. And you would say, well, why is that? They're looking to really enhance the game of golf in terms of getting more people interested.\r\nWhen you're watching television, you're going to see 2, 3, 4 players. That's who is being followed. The commentators and the anchors are giving commentary on those, but not on the field of 120 because that's the field there. But if you can do more about go after all 120, let you follow the player of your choice, give commentary and statistics on that, create fantasy teams, all of a sudden, the client engagement. Just last year, I believe we upped it by about 20%, in terms of number of people and then the amount of time they spend. So that begins to be a real proof point for them.\r\nAnd we do this, by the way, for a lot of sporting events. The last two that we just signed up, but more to come on that in the future are, UFC and Ferrari. So it's a very similar tack, leveraging all of the AI and all of the data to begin to increase the amount of time fan spend on the sites. That in the end, drives a business proposition for the sponsors.\r\nSo changing gears just a little bit. It's not just portfolio. How we do it is incredibly important. Take speed. If you're a risk-averse culture, you're going to sort of say, well, I need a bit more time to get things done. I need a bit more resource to get things done. I'm not 100% sure how do we get it done? I talked a little bit about our mainframe Code Assistant, the one that went from COBOL towards Java or COBOL to COBOL. You could do that in 2 years, and people will think, hey, that's not bad. But we did it in 6 months. And each time we press the team, they came back with a better and better time line.\r\nYes, near the end, it gets uncomfortable, which is where the risk tolerance comes in because you're not 100% sure that you actually know everything. But if you have some risk tolerance, and if you run at the end, then that is going to give you a lot of confidence in being able to get there. So that is what I mean by speed and risk tolerance.\r\nAnd then talent, how do you get the talent that is kind of built for growth, who's built on wanting to be innovative, who's built for wanting to delight the clients more and more is kind of the talent that we're holding in on. And that is why I think that the cultural aspects that are there are favoring performance, and allowing a fair amount of discomfort, I'll call it, within the teams. It really, I think, propels what we do a lot more forward.\r\nAnd if you think about this, where is the outcome? So Software growth accelerated to 9%, I mentioned that at the beginning. We have increased our R&D spending to 12% from 9% of our revenues. We're accelerating the innovation speed. You'll see some great examples from both Rob and Ric in terms of what we are bringing to market and delivering to market.\r\nIn Consulting, we have a $4 billion in our GenAI book of business inception to date. And Infrastructure. The best proof point when we will talk about Transaction Processing, is how is the platform doing? Well, the platform that is now almost in its 12th quarter, is already at 120% program to program, meaning the current generation of mainframe compared to the prior, that is the revenue increase in the program cycle.\r\nSo that tells you it's a lot more. And if you look at the underlying MIPS or total capacity, that over the last three platforms, three generations, I think, is 3x above where it was. So volume is up, dollars are up. I think that's a great mixture and speaks to the durability of that platform.\r\nWe have focused on M&A. We do about 3/4 of our acquisitions in Software. It gives us about 1 to 2 points of growth at the IBM level. If I look in Software, if I look at the last 12 months, I think between 2 and 3 points came from acquisitions. Consulting, not that much in the last 12 months. But if I look at it in the long term, it's the same. About 2 points can come from acquisitions, but not a lot more.\r\nWe have a number there. I mean, like one I'll touch on because I talked about automation and getting a sense of where best to deploy our infrastructure is Apptio. I think that was a great acquisition for us, really drove a lot more attention and then brings attention to the rest of our automation portfolio.\r\nWe've also been very focused on taking out things that we think are not germane to driving our core business in both hybrid cloud and AI. Kyndryl, which many of you know, we took out our managed infrastructure business in 2021, but also some of the assets that we were finding were not having a lot of synergy towards the flywheel. So Watson Health, Weather Company are examples that we took out in the last couple of years.\r\nAnd the deal that we are very excited about is what we did with Palo Alto Networks, where we divested a portion of the QRadar assets to them, but in return, they're building a great consulting business on our Consulting platforms. And we sell with them. So now we have no conflict. So our data security portfolio, our identity portfolio, coupled with their threat management portfolio, we think, is a great answer for our client in this day of cyber, and that sort of gives a synergistic story to both sides. So we are very, very focused on those.",
        "And begin to close up, look, our ecosystem multiplier. If you think of those in the very heart of the circle, the SAPs, the Oracles, the Salesforces, AWS, Azure, those are all businesses that we -- 1, 2, 3, 4 of them are getting close to $1 billion of business or well above that for us already. And the others, we think will get there. So that's the scale of the partnership that is there in the inner most circle.\r\nLots of those in the next layer that we're very excited about, what we do with Dell, what we do with Intel, Box, AMD, CoreWeave, NVIDIA, Lenovo, Nokia. Some of the names will probably surprise you. But we do business in all of these, that is tens to hundreds of millions of dollars, we think we'll keep growing.\r\nAnd then there is a very large set of both ISVs and SIs, where we do business with and we build things together. And we believe that these will have a lot of traction. We believe we'll graduate a lot of those in the outermost into the middle circle. And then some will graduate from the middle towards the inner most. That's kind of the way it goes.\r\nBut these are all areas where it's not a transaction. I call it a partnership because they get more value than we get in most cases. And in the end, the business gets the most value. And that's kind of why I call these an ecosystem and a partner network.\r\nSo you want us talk about our product ready. We are very, very focused on it. These are hard numbers. We're based on ourselves back to 2022. And since then, we've taken $3.5 billion out by being pretty ruthless and straightforward. How do we optimize the portfolio? How do we apply the things we're talking about in Gen AI to ourselves as a client? So we do every enterprise process with much, much more efficiency. How do we scale the business by not adding other costs other than technology cost? How do we begin to put a lot more investment into our experiential sales teams? And how do we leverage partners?\r\nPutting all of that together, when we laid it out and Jim will touch on this a bit more, we have taken $3.5 billion out of the business in those pieces to reinvest back. You saw us increase R&D from 9% to 12%. You saw us increase our technical sales. Those are areas that we're putting it back into. And if you look at our PTI margin as we're doing all this, we have gone from 10% in 2020, up to 18% as we finish 2024. So I think it kind of speaks to what we can do. And we're not done. You'll hear Jim lay out some very precise milestones for what is to come.\r\nAlong with that and the revenue growth, we are generating free cash flow. You saw us grow our free cash flow. Our free cash flow is going ahead of our revenue growth, and we expect that will continue. I'll let Jim lay it out there. Last 3 years, when we measure ourselves, 3% revenue growth. We told you that we'll do 5% going forward. In the next 3 sections, you'll get quite a bit about why we have such conviction on the 5%, but we do. When we look at our portfolio, we look at the book of business, we look at the demand signals, we are very, very happy for that. That's coupled with the value that we have delivered back to our shareholders over the last 3 years, which many of you have written about. And we hope that today, we'll convince even more of you that, that is going to continue. That is not -- we are done. We're not pausing there.\r\nWe think with the revenue growth, with the improving margins, and note, I use improving margins, not stable margins, there's much, much more of that to come. Along with, we are committed to our dividend. We have had 29 years behind us of dividend increases, and we think we are at a very healthy payout ratio now as we exit 2024 there.\r\nSo if we look at all of that together, look, we are committed to maximizing value for our shareholders. We think that we have a company that's very focused on growth, that's very focused on innovation. Along with that, we are focused on improving our growth rate. So we are increasing it from 3% to 5%. Our free cash flow growth is always going to exceed our revenue growth. We'll come back and make it very numerical for you. And we're going to return capital to shareholders, whether it's through dividend increases as well as all other methods, but we are giving ourselves the flexibility now because of $13.5 billion, we have the flexibility.\r\nSo with that, let me turn it over to Matt and Ritika to talk to you about AI and Matt will start off."
      ],
      "session": "management_discussion"
    },
    {
      "name": "Matt Hicks",
      "speech": [
        "Thanks, Arvind. Thank you. So I'm Matt Hicks. I'm joined by Ritika Gunnar, and we're going to talk with you about in AI, why we're excited about this market, and why we're differentiated in a little bit more detail. And then how we're going to market, what products do we have? What are our entry points for clients?\r\nSo let's jump right into the market itself. All of us here are probably familiar with the consumer AI market. That's like the ChatGPTs of the world. That is not where we're focused on it. There will be some technology overlap, but the requirements, the complexity that it takes to automate a business process for an enterprise is just a different market. That's the enterprise AI market. That's where we focus. This is a really exciting market opportunity for us. It's fast growing at a 28% percent CAGR projected over the next 5 years. And we are also right at the beginning of this market. So there's almost ubiquitous interest. 98% of enterprises have already started to experiment with this, and only 26% are in production. That's really our opportunity is to help move that from interest into success in production.\r\nNow when we talk to customers about, why is there this gap? Why is there so much interest? But there isn't as much in production right now. The challenges tend to fall in these three buckets: cost, complexity and expertise.\r\nCost is pretty easy. We all know the consumer AI side, most of these POCs start with large or you hear them call it frontier models sometimes. And if that POC works, the volume that you need to run as an enterprise, just usually financially doesn't work. It's more expensive than the solutions that you already have in play. And you can see this in the data of 85% of companies are already seeking alternatives to larger models.\r\nIf you get past the cost challenge, you're into the complexity challenge because you're not planning a family vacation. You're trying to like actually automate an enterprise business process that's core to your business. And the manageability of that, the visibility, the ability to train some of these models on your IP is exceedingly complex. That's the second bucket of challenge.\r\nAnd then the third, even if you know what you want to do, having the expertise on hand on your teams to pull it off is a really significant challenge in the market right now. And you see this with 71% of executives don't believe they have the talent on their teams to pull off what they want to do in Gen AI. So these are the three buckets or the three challenges that keep us closer to 26% than the 98% in production.\r\nSo we're really excited about our ability to differentiate in this to help get customers pass those three challenges. Arvind talked a little bit about our approach: open source innovation, focus on cost efficiency, smaller specialized models, being able to play off the strength of hybrid and then having the domain expertise, both in technology and people to close the gap.\r\nLet me go through each one of these in a little more detail. Open source. I've been at Red Hat for a long time. This is what we live. We often talk about open source being a great development model that drives innovation faster. There's no better example to that than the world recognizing what DeepSeek put out in the last couple of weeks. That was not a disruption event for us. We were really excited. They did very impressive work on reinforcement learning techniques or chain of thought training for models. That is work we get to learn from, utilize, iterate on and include in our offerings. This is how open source works.\r\nBut you need two things to do that. You need to actually understand the domain and given the strength of IBM Research, they know AI. We actually understand these concepts. We know how to iterate on them. And between IBM and Red Hat, we know how to commercialize this to enterprises. This is what Red Hat has always done, and we're extending this into the AI areas for it. So that's open source.\r\nLet's move in to cost-efficient area. It's a complex slide, so I'll try to walk you all through this. So first, these are scenarios on probably the most common enterprise pattern, which is called RAG, just querying documents with a large language model. We often talk about being more cost efficient. So look at the far right column first. When we talk about cost efficient, this was a financial planning use case and accounting use case, both using RAG.\r\nWhen we ran these on the Granite models, in the first case, we were 98% cheaper than GPT-4 Turbo. In the second case, we're 75% cheaper than Llama 70B. Now when you talk about being that much cheaper, the immediate response is, well, are you actually going to be able to give results as good as these larger models on it. And that's the first column, this performance column, by being able to train knowledge into these smaller specialized models, we're actually able to beat performance in both of these cases.\r\nThis is really the power. When we talk about the market understanding what these smaller distilled DeepSeek models can do, this has been our business. And being able to take smaller specialized models, train them and actually exceed in results at a fraction of the cost. So when we talk about cost efficiency, this is really the power there.\r\nSo let's jump into hybrid. Hybrid, we often talk about running anywhere. If you're familiar with Red Hat, we'll say like we run in the private data center. We run in the public clouds. We run on the mainframe. We run in the factories. We're running in vehicles, we run in the space station. We run everywhere. And we have done that for applications.\r\nWe're extending that same capability to AI because when you want to reduce complexity and be efficient, you need to run as close to the use case as you can with it. With our acquisition of Neural Magic, we're not just training models, putting your knowledge into models now. We now are planning a flag in terms of being able to provide a world-leading open source inference capability in all of these locations. So being able to run any open source model as efficient as possible built on that open source innovation model is what Neural Magic gives us. So we're taking the capabilities of hybrid that Red Hat is known for, that's how we deploy, and then we're extending that to be able to run AI workloads in all those locations.\r\nSo lastly, then you get to domain expertise. And when we talk about the complexity of applying this to a business process, there is a difference between a procurement process, HR process, customer support process. So on one side is this is having technology that knows the domain to help you close that last mile in automation.\r\nAnd the second part of this is even if you have all the technology, do you have the people to pull it off. When you look at the technology side, this is what Ritika will talk about in the watsonx portfolio. This is really where it shines. And on the people side, this is where IBM Consulting shines. So they have the breadth and depth to be able to pull off projects at any scale. They have 75,000 trained consultants. Mohamad's team knows this stack as well as any group on the planet and has built impressive technology that builds off that and Consulting Advantage. So that's the domain expertise gap.\r\nSo when we talk about those three challenges, cost, complexity and domain expertise. Cost, hopefully, I've convinced you on that. Smaller specialized models, it is an area we know they can perform impressive returns, especially in enterprise use cases. Complexity, we closed the gap with hybrid we're actually able to take the technology that's in watsonx to close that technology gap, and domain expertise we have that with IBM Consulting.\r\nSo lastly, let's talk about what we do. How do we go to market? What are the products involved with this. I'll start at the red layer, Arvind referred to that as like the Red Hat coding in it. Because we do the building blocks for this, and we have two.\r\nYou know Red Hat, you might think of Red Hat as taking Linux open source innovation and then commercializing that is Red Hat Enterprise Linux, or RHEL. That's what we started with. That was take any applications and let them run on any CPU hardware with Linux. We're doing the exact same thing in with open source AI innovation with RHEL AI. Take any open source AI models allow you to inject knowledge into them, run them as efficiently as possible on any GPU hardware for it. That is RHEL AI.\r\nThat's what gives you that first success point in saying, taking a model, I've trained it on my business, I've gotten results that I can run at volume, and if you can get that one success, then you need to actually know how you're going to scale that, and that's what we do with OpenShift AI. So if you can take one box, which is RHEL AI we sell it against GPU cards that are in it, and you want to extend that across a cluster that's what we provide with OpenShift AI.\r\nWe actually run OpenShift AI. We train Granite with it. We run at some of the largest environments in the world right now. So we have that reach and scale to make you successful with the first building block and then be able to scale that as much as you want.\r\nNow if you're a customer, these building blocks may be all that you need if you have the technology, the expertise. You can start with them and connect them to your business. But most of the customers we talk to, they do not have the skills and expertise. They need help in actually bringing building blocks to changing their business processes. This is where watsonx and the portfolio comes in.\r\nRitika, over to you."
      ],
      "session": "management_discussion"
    },
    {
      "name": "Ritika Gunnar",
      "speech": [
        "Thank you, Matt. I want to start a little bit from the importance of having a holistic portfolio and set of expertise. Our integrated set of offerings and our holistic portfolio from our entire AI stack and our expertise are absolutely core and well-integrated and help our clients address their enterprise AI needs.\r\nI want to start with Infrastructure in this diagram, where today, the mainframe and Storage play absolutely critical roles in our clients' enterprise generative AI strategies. When you look at some of the innovations on the mainframe like the z16 Telum processor, it enables real time in-line AI inferencing to be able to accelerate use cases like fraud detection. Our Storage portfolio has a vast amount of enterprise unstructured data that is enabled for enterprise generative AI technologies.\r\nNow built on that Matt just talked about OpenShift AI and RHEL AI. This is the foundation of our software AI stack. He talked about the importance of OpenShift AI and RHEL AI and the capabilities it provides, it has a set of open source models, including the IBM Granite models for which you saw a lot of the results, as well as InstructLab, which provides model alignment techniques to optimize the entire AI stack.\r\nIn addition to that, what we have with OpenShift AI and RHEL AI is the ability to provide enterprise-grade security to be able to provide support and model indemnification. This is the core foundation that our enterprise clients need.\r\nNow built on top of Red Hat's hybrid Open AI tools, we've built enterprise data services and AI middleware that is powered by watsonx. This helps our clients be able to build, to be able to run and to be able to manage their AI workflows and infuse that in their core applications with their data, which is essential, and I'll go into that on the next page.\r\nAnd with this, we have really focused on building a set of AI assistance and agents that are powered by watsonx Orchestrate, which leverages AI to be able to provide automation of our clients' most essential business processes, and helping them be able to drive efficiencies and productivity while still helping them accelerate innovation and new styles of experiences, which we find are essential for our clients. This is the foundation for a series of assistance and agents that we've released.\r\nYou heard Arvind talk about our watsonx Code Assistant for Z, which we released earlier this year, and it's getting substantial traction. Now this AI stack is powered by a series of ecosystem partners and technology providers. And it's underpinned by IBM Consulting, which is core in helping our clients understand their generative AI strategy through their domain rich expertise that our IBM Consulting team provides and the AI assets through IBM Consulting Advantage, our delivery platform. And you'll hear Mohamad talk more about that in just a moment.\r\nBut I'm going to dig a little bit deeper into watsonx. Now watsonx was introduced a little over 18 months ago, and we've seen strong adoption in our enterprise clients. We've seen it solve some of the most complex challenges in our enterprise engagements. And I thought I'd bring you just three areas where we see a real network effect happening.\r\nThe first is where we see AI driving automation in core essential business processes across multiple back-end systems and applications. This is where by using GenAI-driven automation, we help our clients take out complexity within their organizations, and thereby help them drive more productivity, help them drive more innovation using watsonx Orchestrate.\r\nNow we're seeing demand in some key areas, and I want to go through them. First, we're seeing demand in areas like human resources where we can use AI-powered automation to be able to drive use cases like client screening -- sorry, like screening of different employees or prospects, like being able to use AI automation to be able to accelerate employee onboarding, to be able to use -- to be able to improve employee engagement.\r\nWe're also seeing it being used in procurement, where we can automate end-to-end workflows like quote to cash or what it means to manage different contracts. We're seeing it being used in customer care where we can provide digital AI-enabled experiences that provide 24/7 support for our clients' users, and at the same time, optimize and make our clients more efficient in how they operate. We're also being seen -- we're also seeing AI being used in use cases like supply chain, where you can automate the full end-to-end workflow using AI and improve what it means to be able to have modeling -- to be able to have inventory.\r\nAnother area of focus that we see is AI automation being applied to sales, where we see it being used to be able to provide personalized experiences for sellers to help them on their enablement journey, help them accelerate their prospecting experiences or what it means to be able to manage opportunities in their pipeline.\r\nAnother area where we're seeing watsonx being used is really solving the enterprise GenAI data problem. For most of our clients enterprise generative AI is a data problem. I want you to think about this for a moment. Only 1% of enterprise data is represented in large language models today. This is the opportunity for most of our clients being able to take the proprietary data that they have and unlocking that with the public data that exists in large language models is a big opportunity.\r\nAnd with watsonx data, what we do is we enable all data, structured and unstructured and make that ready for AI. And this is important because today, over 80% of the work that goes into these generative AI workloads happens trying to prepare data and make it ready for AI. These include things like being able to use document processing to really understand different documents, what it means to be able to create metadata from all the different data that you have, what it means to be able to create and munge data pipelines. All of this is really essential for clients to be able to bring value from their data.\r\nAnd for us, what's really important is to make sure as our clients are on their enterprise AI journey that they're able to infuse enterprise knowledge into their GenAI workflows.\r\nAnd as our clients infuse AI into their applications with their data, we're on a journey with them to make sure that they can do that with trust, with transparency, with operational efficiency using our watsonx AI middleware. This is one of the reasons why we see a number of clients using watsonx for their enterprise AI adoption needs.\r\nBut I thought one of the things I do is go through a few use cases of why we see industry leaders using IBM watsonx for their solutions. Starting with Dell, which is using watsonx including watsonx Orchestrate as a core part of their AI solutions. Dell is using watsonx for multiple different use cases, including internal productivity where they're using AI and automation to be able to create value.\r\nWe're partnering with NatWest to be able to modernize their conversational AI agent, Cora+ and be able to use that to be able to have very natural language interactions that solve even the most complex questions, creating improved client satisfaction across their 11 million customers that they have.\r\nWe've also partnered with Lockheed Martin to have watsonx and our Granite models as a core part of their solutions, driving very cost-efficient easy to deploy Granite models for over 10,000 of their internal employees.\r\nAnd for the UFC, where you heard Arvind talk about where they're using watsonx as a core way to be able to generate real-time insights for their over 700 million global fans.\r\nNow I want to end on some proof points of our award-winning strategy, starting with industry recognition where many analysts and influencers have really recognized IBM as a trusted partner in this space, including Gartner, who ranked IBM as a leader in their most recent GenAI emerging Magic Quadrant.\r\nWe're also, as you see, leveraging GenAI across our own use cases, where internally within Red Hat, we're using it to address support use cases and improve customer experience, seeing over a 600% return on investment. This is just one of many different use cases where we're using generative AI across IBM to improve the innovation that we have, productivity and efficiency.\r\nAs you heard, we're also seeing great market traction with over our $500 billion book of AI business across Consulting and Software. This demonstrates the momentum that we have in our portfolio and also shows the synergies between our portfolio, where for every dollar of watsonx, we drive $5 to $6 of Software and Consulting. Our open, hybrid and comprehensive AI portfolio is a winning strategy for our clients.\r\nAnd with that, I'll bring up Rob to talk about our Software portfolio. Thank you."
      ],
      "session": "management_discussion"
    },
    {
      "name": "Robert Thomas",
      "speech": [
        "Thank you. Hello, everybody. Thank you for spending time with us today. We are really pleased with the momentum that we've created in Software.\r\nLook back at 2020, we've massively increased the growth rate. As Jim alluded to on the call last week, we achieved Rule of 40 for last year. And it's never one thing. It's a combination of how we've modernized our go-to-market, bringing a lot more technical skills in the go-to-market. It's the innovation that we've delivered in our products. It's our ecosystem partnerships. It's many different things that has created a ton of momentum for us in Software. We are super pleased about that. Today, the business is 80% recurring revenue, which is a very healthy business. We got 6 points of organic growth last year, which was a huge milestone for us.\r\nAnd as Ritika and Matt alluded to, we've now generated $1 billion in our book of business for Software. So we have a lot of momentum and still a long way to go. And probably the most encouraging thing is I think the market has moved in our direction. Think about the tailwinds. Arvind talked about the stat. 73% of companies have now adopted hybrid cloud. They still have a ways to go even within that 73%. Do we get to 100%? Maybe not because there'll be some companies that are born purely on public cloud, but the addressable market here probably gets towards 95%. So we're still in the early days of what's happening in containers and hybrid cloud, and that can be a significant tailwind.\r\nSecondly, this was a stat from Gartner says that by 2027, 50% of models, AI models in production will be domain-specific. That's up from 1% in 2023. That plays exactly to the strategy that you just heard us talk about in terms of what we're doing with AI. So you take the tailwind in hybrid cloud, the tailwind in AI, IBM is the only company that can deliver software where you can build, deploy, manage on hybrid cloud, leveraging AI. We think we've hit the right value proposition at the right point in time. You can see it in the momentum in the last few years, but even going forward, we're very encouraged about what is possible.\r\nIt's also nice to see analysts begin to recognize what we've done. Think back a few years ago, we didn't show up in a lot of Gartner MQs, to be honest. Ending 2024, we were in the leader quadrant in 9 Gartner Magic Quadrants. We are the de facto leader in Cloud Financial Management Tools and service orchestration, just to name two. We are the leader in 9 IDC MarketScapes, 7 Forrester Wave. So to some extent, it's a validation and a recognition that we've made major progress in how we're delivering software and hitting the value proposition that clients expect.\r\nSo what is software today? We think it's important, and it's our place in the world to deliver all the enterprise capabilities that you need for hybrid cloud and AI. Obviously, it starts with hybrid cloud. It includes automation, everything for automating your technology, your operations, your financial management. Data and Transaction Processing, which is the world's greatest Transaction Processing platform.\r\nWhere do watsonx and Security fit in this? Think of them as an ingredient across each of these areas of Software. For watsonx, we've got Ansible Lightspeed. We have delivered it in concert for resiliency as part of automation. Ritika and Matt covered how watsonx is throughout data for assistants and agents. And we've delivered watsonx Assistant for Z and Code Assistant for Z.\r\nIn terms of Security, we have zSecure, which is ID for Transaction Processing. We've got data security with Guardium, the best data security product in the world. We've got security for identity and automation. And we have container security and hybrid cloud. So think of these as an ingredient across each of these elements of Software.\r\nProbably the most encouraging thing is if you look at these categories of software, 80% of our clients are using products from multiple categories. So that represents pretty tremendous upsell that we've been able to do. And I would say just the beginning of the cross-sell that can happen because the minute a client decides their strategy is hybrid cloud, IBM becomes the answer. And then it's about how do we deliver different capabilities to do that.\r\nLet's talk a little bit about the growth drivers for each of these. So we have four segments. You can see they're all similar in size, and we've delivered solid growth across each of these. But there's some key drivers of each as we're looking forward.\r\nFor Red Hat, first and foremost, it is going to be about containers. As you can see here, 95% of businesses will adopt containers between now and 2029. Again, we're probably in the second or third inning around what's happening with containers, and we think we are very well positioned with how we're delivering innovation in Red Hat.\r\nNext growth driver is around virtualization. Every client is looking at what are my options for virtualization. And what I see today is half kind of goes straight to containers, so they'll jump straight to OpenShift. And maybe the other half start with Red Hat virtualization as they work through their application strategy and the right timing. That's a big tailwind as well as everything that we're doing in AI, which was discussed before. A lot of momentum in hybrid cloud, more to come.\r\nIn terms of automation, we think we've built the best portfolio in enterprise software for how you automate everything that you're doing in technology and operations. We then now are extending that to things like resiliency with Concert that we announced at Think last year. And I would say the timing was probably perfect on that because every client has started to shift their focus towards resiliency and how do I make a hybrid infrastructure as resilient as when I can control everything myself. We think we have a good value proposition for that.\r\nAnd then with what we're doing in automation, we're also looking for how do we continue to increase the addressable market, but areas that are adjacent to what we're doing. One of those I would highlight is software-defined networking. Most of the network into the world is still attached to hardware. It's not very flexible. It's not very cost effective. So that's one example of an adjacent space that can be a growth driver for what we're doing in automation.\r\nIn data, this is about the, I'll call it, the next generation warehouse or lakehouse battle. If you look at the history of software, every 7 to 10 years, the warehouse architecture changes. It's gone from OLAP to appliances to separated compute and storage. We think we're at the start of what will be a new data architecture, which will be heavily focused on unstructured data. That is the 90% of the data in the world that is largely ignored by most clients. We think that can be a significant growth driver for what we're doing in data.\r\nWe have some of the world's leading SaaS products in data, watsonx Orchestrate, Planning Analytics, OpenPages, just to name three. And by definition, SaaS is a fast-growing market that increases our addressable market. And ultimately, data is about how do you make data ready for AI. Whether it's data streaming, data quality, organizing your data, we think each of these can be drivers for data.\r\nLastly, on Transaction Processing. There's a couple of elements here. First and foremost is about consumption. Everybody asks why is Transaction Processing performing the way it is. It really works. It's really resilient. It's the most secure platform in the world and clients are consuming more. It's pretty simple, actually.\r\nThe second element, probably less talked about, is we are delivering a lot of new product on mainframe, whether it's mainframe tools, integrating with the OpenShift ecosystem, the investments in AI tools around mainframe, all of these can be growth drivers because as clients are consuming, they're looking for how do I make this easier to use, we think we can provide that as part of what we're doing in Software.\r\nThe foundation for all of this is Red Hat. So it is worth mentioning explicitly for a moment because back when we did the acquisition of Red Hat, we talked about how this can become a catalyst for all of IBM Software. And I think you would agree at this point that has played out. OpenShift is doing incredibly well, $1.4 billion ARR, growing 20%. Like I said, I still think containers are in the second or third inning, so it's just getting started.\r\nRed Hat Enterprise Linux, who would have thought, but clients are looking for a standard on operating systems, and they're looking for something that's secure because access to the operating system from a bad actor can do a lot of damage. The combination of those factors has brought Red Hat Enterprise Linux back to high single-digit growth, which is a great milestone.\r\nAnsible, I would say we're just getting started on it. It's growing 20%. It's another lever as clients think about my day 2 operations and how do I automate what I'm doing in my infrastructure and applications. You take all these together, to some extent, we shouldn't be surprised, double-digit bookings growth for 6 consecutive quarters, which sets up a lot of momentum for how we're going forward.\r\nSo we talked about Red Hat being a catalyst for the Software business. I would say the other element, and Arvind alluded to this a bit, is the cultural element around innovation. And I think Red Hat has been a great catalyst for IBM on creating a culture of innovation. I would actually call it a new era of innovation here in IBM.\r\nIf you kind of look at it by year, you start back in 2020, we built Cloud Paks. That forced our engineering teams to learn how are we going to build for containers? How are we going to build for modern cloud deployments, leveraging micro services? That was a catalyst moment for us in 2020. You go into 2021, we started to deliver the whole strategy around automation. We didn't really have much in automation before 2020. We built that out. You moved to 2023, we introduced watsonx, which created a bunch of different innovation opportunities. You move to '24, we delivered a lot more capability across resiliency, data.\r\nWe are just getting started here, but it's probably one of the things I'm most excited about is the talent that we've built in IBM to deliver products is unlike we've seen in a long time, and I am super proud of this team.\r\nI'd say the other catalyst that is probably less talked about, if you look at this at the bottom of this slide, it was -- I think it was end of 2021, we made a decision to put IBM Software on to AWS and Azure. I think many people scratch their heads, why would you do that? Isn't that a competitor? We thought the opportunity working together was way bigger than not. And so today, we have about 70 IBM products on AWS. We have about half that on Azure. And again, what has it done? It's taught us a new way to deliver software. So it has our teams moving much faster and innovating at a rate and pace that they weren't before.\r\nSecondly, is it gives us go-to-market distribution. As we make products available in the marketplaces on both of these cloud providers, clients have a different way to access our technology. So sometimes we win deals without ever talking to a client, which is incredible in terms of the momentum that can create for us. So I think this was a great decision, and we're just at the start of what we can do partnering with hyperscalers.\r\nLet's go a little bit more on this culture of innovation. We've done a lot to build out engineering capacity. One of my observations as we really were thinking through this, was, we don't have enough engineers period for what we need to do. And you can see we've been building capacity in the R&D numbers that Arvind shared before. We've opened new labs in Tier 2 cities in India: Kochi and Gandhinagar. We opened a lab in Riyadh, Saudi Arabia. We've really embraced, I'd say, an engineering culture around the world, which were just additions to our global footprint.\r\nWe're using AI to build products. And I'd say, taking a different approach to innovation. We have one platform for how we deliver SaaS, which leverages OpenShift. So we can easily move products from one cloud to another. We're using generative AI when we build products. Today, 6% of our code is generated by AI that shows up in products for shipping. I know a lot of people use AI for demos, but to actually have 6% generated by AI, show up in a product that ships to a client, we think that's a great achievement. And we think we can get that to be 25% plus in the future.\r\nWe've adopted metrics like DORA to drive rate and pace and quality of engineering. And we've been able to use a lot of our own AI capabilities to automate how we're doing client support. And clients are the ultimate voter of our success. So we want them to love working with IBM. I think we've made a lot of progress on that, but there's still more to come.\r\nI think you would expect some of the long-time customers that you see on the left side here, I think IBM is traditionally associated with Fortune 100, Fortune 500. We've proven we can do new client acquisition in the last few years, and that is a key part of how we will continue to expand. Some of the logo on the right side may surprise you. Maybe you wouldn't think of them as being IBM clients. But it tends to be a land and then grow type motion here. Pick one product, get them excited using the product help them be successful, and then clients will tend to grow. And I think we've proven we know how to acquire new clients, which will be a big growth lever for us going forward.\r\nThree to highlight, just to give you a sense of, I'd say, the variety of what we can do. Water Corporation delivers all the water services in Australia. They were on premises. They wanted to be on AWS. We've helped them through that. They're using watsonx Code Assistant. They're using Ansible. They're using our software to modernize the cloud, landing on AWS, and we've been able to help them with IBM Consulting. It's a great example of how we can be indexed to growth that happens in public cloud through software that we provide through our consulting services. I think that's a great example.\r\nCamping World is the world's largest manufacturer of recreational vehicles, probably not something that you would -- somebody that you would think of as an IBM client. But they saw the opportunity to increase productivity in their client acquisition and their sales engagement. They've increased their customer engagement by 40% since they started using watsonx. So these are real proof points that have an immediate impact on the bottom line.\r\nFiserv based right here in New York, I think a great example. We started on AI for payments, helping them leverage AI to deliver a modernized payment solution. Now we've extended it to watsonx being embedded across their portfolio as they deliver for clients.\r\nThese are just three examples that give you a sense that we can start on hybrid cloud. We can start on AI. We may start in one of the categories I talked about, automation or data. But any client that we start with, we're confident that there's going to be an expansion opportunity as we deliver.\r\nAnd I would say a lot of that is based on the progress that we've made in go-to-market. I talked to many of you about how we decided about 4 years ago, we were going to create a much more technical go-to-market, experiential. We want clients to have less steak dinners and more code written in the sales engagement. And we can do a little bit of both. But the reality is it's really working because clients are seeing a new IBM that shows up in a different way. We simplified our complete go-to-market model. We changed our incentives. So people are really motivated to get out there and get software deployed, get it utilized, get it sold.\r\nWe've built strategic partnerships, talked about AWS and Azure, but this extends to partners like SAP, Salesforce, Adobe, Palo Alto, just to name a few. There's a lot of magic that happens when technology providers that have a, let's say, common interest in integrated products go to market together. So I think we've created a lot of momentum in go-to-market. There's more to come there.\r\nAs we think about client expansion, we have the proof points on new client acquisition. Now it's just about continuing the momentum. We've built a new digital demand engine as part of our marketing and communications team. We can actually deliver and fulfill products via e-commerce, which is not something we were doing before. So this is all about how do we create demand and introduce clients that may not think of IBM as their first choice. How do we become more engaged with them because we are confident if we can prove out the technology and they see it, they will like working with IBM.\r\nAll right. To close, we talked about this flywheel for growth. Where does Software fit in all this? First of all, we've really focused the portfolio. Hybrid cloud and AI, that focus has also driven the cultural change that I talked about, delivered 9% in 2024, accelerating. We feel like there's a lot of momentum there. Red Hat is the foundation for all of this that we've talked about. I mentioned the growth drivers around containers, virtualization, AI, we get a 2 to 3x multiplier when we sell OpenShift, meaning somebody buys OpenShift, they start working with us. That gives us an opportunity to then position the rest of the IBM Software portfolio.\r\nI think we've built some great early leadership in generative AI. I think 2025 is going to be all about value creation on AI. So the combination of our post-sales technical teams like customer success and our consulting team, we think we can demonstrate value creation, which I think is going to be the ultimate bar for success on AI in 2025 and beyond.\r\nWe've extended leadership. We've got great innovation that's happening organically continue to look at synergistic M&A to round out what we're doing. And as I mentioned, we'll still keep going on the go-to-market transformation because we always want to be better.\r\nLastly, I'll finish on this point of incumbency and trust. 93% of the Fortune 500 use hybrid cloud products from IBM. That is an incredible foundation for everything that we're doing. So we are excited.\r\nAnd with that, I'm going to hand it over to Mohamad Ali, who's going to take you through IBM Consulting. Mohamad?"
      ],
      "session": "management_discussion"
    },
    {
      "name": "Mohamad Ali",
      "speech": [
        "Thank you, Rob. I think I'm ready to buy some software, even though he's never offered me a steak dinner, just so you know. Good afternoon, and it's really great to have you all here.",
        "I think as most of you know, IBM Consulting is a global business. We serve clients in 75 countries. And we have deep and trusted relationships with the world's largest companies and governments. But the right-hand side of this, it says skills and expertise. I want to double down on this because I was counting as Arvind was presenting. And I noticed he used the word domain expertise 4x. There must be something really important about that, and there is. This is a big part of why clients come to us. We have over 350,000 certifications. In IBM products, our strategic partner products like AWS, Microsoft, SAP, Oracle; and Industries: Financial services, government, transportation, these skills are what allow us to best serve our clients. And we deliver what our clients need in a large and growing market. Clients are looking for the same thing that you're looking for in your investments, and you're looking for in your company, which is top line growth and bottom line productivity. So those are the services we provide.",
        "On the top line, our services anchor around growth, innovation and customer experience. And on the bottom line, cost savings, productivity and cybersecurity. And as I mentioned, we operate in a large and growing market. Over the next 3 years, this market is expected to grow at 6%. And we've anchored on 2 large growth segments: hybrid cloud services, where, as you've heard, we've been winning for a number of years and will continue to win. And now in AI services. And in AI services, we've taken an early lead with a $4 billion book of business. Why? Why is this so important to us? Because like hybrid cloud, this is a must win for us. We must win in the AI services world. Not just because it is the next big technology wave, but because clients are demanding it. A large majority of clients now are expecting consulting services to be powered by AI. And this is a moment for us to break away from the pack in consulting. And as you could see, we're going all out. And it turns out that clients who are buying AI services from us now, that's $4 billion book of business, and see us as their trusted AI adviser, are coming back to buy more.",
        "Look, consulting is fundamentally changing. Yesterday, this was primarily a people business. Today, it's a people plus AI business. Human plus digital labor. And tomorrow, it's going to be a service as software business. At Riyadh Air, 70% of our engineers who are delivering are doing it with digital labor. This is real. It's happening today. Now to deliver this digital labor at massive scale across hundreds of clients, we had to build a platform, and we call it IBM Consulting Advantage. Now this platform allows us to combine our deep expertise, those domain expertise that Arvind covered, with our AI services in all of our services.",
        "So let me take a moment and summarize what these services are. So our strategy and technology team advises our clients on technology strategy to drive their business strategy and often that is growth and efficiency. Then we'll design or redesign complex end-to-end business processes. And these typically live on business applications like SAP, Salesforce, Oracle, and that is then anchored on hybrid cloud and data infrastructure. And there, we'll have to build, rebuild or even modernize from old code in order to get the right data and hybrid cloud infrastructure to support these business processes.",
        "Now once this is built, someone has to operate it. The client can operate it, which is typical, or they can ask us to operate it. And there, once again, we've embedded AI across the board. And the first area is the client might say, hey, that business process that you just help me build for finance, customer, HR, I want you to operate it, and we will do that in an AI-first BPO manner. We might also provide application management services across application, data and hybrid cloud workloads. And finally, this all has to be done securely and we'll provide the cybersecurity services to do so.",
        "So we are able to deploy AI at such large scale now, $4 billion book of business, because we're combining skills and technology. So on the left-hand side, you see the skills part. We have 75,000 consultants with GenAI certifications. Not just they took a class, they have full certifications on being able to use GenAI to deliver these projects. And on the right-hand side, we built a platform called IBM Consulting Advantage that allows these 75,000 consultants to deliver efficiently and consistently. You just can't do that one at a time. You need to do it in a platform approach.",
        "So let me give you an example. Riyadh Air is building a new premier airline to rival the world's best. So imagine you're a consultant, right? So Ben over here. You're an IBM Consultant now. And your job is to build the mobile app for Riyadh Air, very exciting. So how do you do this? Well, you're going to use Adobe mobile experience to build it. But the first thing that you do is you log on to Consulting Advantage. And there, you're going to use a number of assets that live inside of Consulting Advantage. These assets could be agents depicted in green here, the digital labor, could be applications, prebuilt applications, chunks of code, depicted in blue or it could be methods, depicted in red, to stitch it together. So what do you do? You start with a set of agents. And they help you side-by-side to develop user requirements, write the code, develop the unit test scripts, et cetera. Then you say, hey, I need some pieces of IP in order to build this out. So you might go to the set of prebuilt applications, there might be a piece of IP for -- specifically mobile -- mobile app for airlines, you might use that piece of IP. But there's one in particular that I want to highlight.",
        "We've built what we call Experience Orchestrator. And what this does, it allows you to very quickly configure Adobe to get what you want out of it. And then you stitch it all together with these methods. And if you do this right, you could get up to 50% productivity gain and deliver that much faster. And this is exactly what our consultants are doing at Riyadh Air.",
        "And what do you get out of this? Three things. First, faster time to value. And I'll talk more about that in a bit. Second, lower cost. And third, greater customer acquisition via superior experience. And again, I'll explain what that means in just one minute. But this is truly a new era of consulting. And I do urge you to go see Consulting Advantage at one of the demo booths.\r\nNow as we lead in this new era of human plus digital labor. It's built on a strong foundation. In the last 3 years, we have seen significant growth, especially among our top clients, our strategic partners, and IBM products. We now have 3 of these strategic partners where our revenues exceed $1 billion, and the others are coming on very strong.",
        "And as Arvind mentioned earlier, and I think Matt as well, we have an extraordinarily strong business around IBM products. And with Red Hat alone, we've generated $16 billion of signings since the acquisition. And in addition, we are influencing significant software sales.\r\nSo look, as we return to growth in 2025 on the back of 23% bookings growth in Q4. We also have a tremendous opportunity to expand margins. And there are 3 areas where we're doing this. The first is productivity. Labor productivity, using traditional methods of utilization, mix, structure. The second is value capture. So all those assets that I talked to you about earlier, those are blocks of IP, those are things we can monetize that can increase our gross margins. And lastly, delivering with AI, which will increase our efficiency. And these 3 together will allow us to expand margins and operating leverage.\r\nSo let's take a moment to hear from one client, and we have several -- many, actually. But this one client where we are leading with human plus digital delivery, let's roll the video.",
        "[Presentation]"
      ],
      "session": "management_discussion"
    },
    {
      "name": "Mohamad Ali",
      "speech": [
        "You know probably my favorite sentence from Adam, the CFO there is, it's not about cost, it's about time, which is kind of interesting to hear from the CFO, right? But time is value. And I want to take through how he's getting that value. And the first one is faster time to value. I mentioned that earlier. What does that mean? He's getting his planes in the air faster than he would have expected. Because we built the entire software stack from ground up faster than he expected from the reservation systems all the way up to the mobile app. That's value right there.",
        "Second is greater customer acquisition and retention. And because we're able to iterate through this mobile app faster, we're able to try many more different things and get him the most compelling experience for his customers, and that will drive greater customer acquisition and retention. And that's what he's excited about when he talks about time. But he's also going to get lower costs. Because as Riyadh Air moves to operate, their costs will be lower because the digital workers that we leave behind will drive efficiency. And I'll give you an example of another client where we're doing that is at massive scale to date. This client has 45 million calls coming in. And of those 45 million calls, we've deployed digital workers to automatically handle 5 million calls. And what has happened is the NPS has gone up and the cost has gone down. So this is what human plus digital labor allows. And this is why we're leaning into this so hard.",
        "So let me finish by coming back to growth. We've repositioned our portfolio to focus on the high-growth markets of hybrid cloud and AI. We've built and are delivering at scale with a combination of human plus digital labor with our Consulting Advantage platform. We're growing with our strategic partners, and we're winning with IBM technology, which is driving consulting services, but also pulling through technology and products, all of which on this chart and the prior charts drive market share expansion and improved margins.",
        "Thank you. Now I'll turn it over to Ric."
      ],
      "session": "management_discussion"
    },
    {
      "name": "Ric Lewis",
      "speech": [
        "Thanks, Mohamad. All right. How are we doing? We're getting close to a break. I promise. I'll bring us home and you'll get a stretch out a little bit, and we'll go from there.",
        "So I'm Ric Lewis, I lead the Infrastructure group. When I last spoke at Investor Day, it was a little over 3 years ago, and I had just joined IBM. So I was still getting my feet grounded, et cetera. But what we did at that time is we set a bold goal for infrastructure. It was a business that had been very profitable for IBM. But honestly, it was flat to declining for many years. And we looked at that and we said, infrastructure worldwide is growing. Can we grow this thing? So we set the goal to say, hey, let's get infrastructure back to growth and let's increase the profitability over where it's been historically. And I'm here and pleased to say that we've done exactly that in the last 3 years. In fact, we set out a 5-year journey for the organization to deliver on those goals, and we've achieved most of those goals in 3 years. So it's something we're very proud of. I'm sure when you hear that, you're thinking that's awesome. How did you do it? And more importantly, is it sustainable? And I'm here to tell you, we believe it's sustainable, and I'm going to show you how and why.",
        "All right. So let's talk a little bit about the segments that we report that all of you understand very well. We have our Z and our distributed infrastructure and infrastructure support there. Z, great momentum. You heard other people talk about that program to program, 3 generations of growth, 70% of the world's transactions by value run through Z systems. It's basically the backbone of the world economy. What we've done in that business is we've focused on innovation. Innovation focused squarely at client needs. The clients tell us exactly what they need coming up, and we innovate in that area. And it's worked really well.",
        "The next one, Power. Number one, infrastructure for distributed compute environments in reliability. That's something our clients count on. Clients like Pfizer, who's had an SAP HANA installation up and running with 0 downtime since before the pandemic. Over 5 years ago, that infrastructure has been running. Our approach in that business has been to focus on workload optimization, make sure that we're the best in the world at Oracle, SAP, all those capabilities on our own databases and being able to run containers and applications on top of their workload optimization and clear market segmentation and being able to capture that value.",
        "The result power is an extremely healthy business. We've got 35,000 clients on it. And I'm happy to say that a business that had been very much declining and very volatile in its program cycles in each of the last 3 years, it has actually grown a small amount. Power has been very stable for us. And so that's something we're really proud of.",
        "Storage, the next chunk there. Storage is an area of opportunity for the industry and we're actually growing faster than the industry in Storage. It's something we're really exploring how can we invest in the hardware side and in the software side. And how can we differentiate more software even in the hardware side, and we're investing to go do that. The results are, we've been growing faster than that market for 2 years. And in the area where we're investing in software-defined storage, we're growing at 1.5x the market rate. So we're extremely proud of the progress we've made in storage.",
        "And last, Infrastructure Support. Many of you watch our results very closely, and you've been watching infrastructure support. And you might have noticed in this last year, it kind of started at minus 7%, and then it was minus 4%, then minus 3%, then flat. We've been working our tails off on our infrastructure support business to get it extremely healthy and make sure that it's resonating with clients. We've always had great NPS scores with our support business. But what we needed to do was really focus on the fundamentals and make sure we're attaching to our product lines, making sure we're doing premium attached so that we give them an even better experience with shorter response time. Make sure that we're renewing on time with the clients and keeping that relationship tight and making sure that we expand the business. Hey, if we're taking care of your IBM Infrastructure, we might as well take care of your whole data center. We might as well take care of all of your networking while we're doing it. So expanding that business has been something that's really helped us there.",
        "And then finally, and you see it in the numbers on here, work on the efficiency of that business. And you can see of the 4.5 billion issues that we worked on a resolution last year, about half of those have some level of automation and AI. So we are a client 0 for our watsonx stack, and we're using that every single day in how we support clients and how we position parts around the globe, et cetera. And it's led to a tremendous stabilization of that support business, something we're very proud about.",
        "So I kind of said, hey, each of the chunks, they look pretty healthy and pretty good. What has that resulted in? Well, if you look program cycle to program cycle, many of you are very familiar with our program cycles, in the last one, the 3 years before, we were at about minus 4%. In this program cycle, we're up 2%. We're growing as a business and we think we can sustain that. But I would say we're even more proud of the second part here, and that is we did that with tremendous operating leverage. We grew 20% in profit from '21 to '24. That's extremely important to the company, and it's important to us because the way that we've been doing so well is investing in innovation, and you've got to fuel that investment for innovation. We also improved our margins across the product line by 3 points. So infrastructure in IBM is very different than it was 3 years ago. It was healthy. Now it's very healthy and continued to be poised to grow here as we go forward.\r\nHow did we do that you might ask. Well, I think it's 4 key things. First, we really invested in innovation across the product line. In Z, we have 100-plus clients that are involved in our deep design process. So they tell us where to go. They tell us what features they need. In storage, we did it by market growth. Where is the opportunity in the market? Where do we think we could position well? And let's prune the offerings in areas where it's not growing and invest in those. Sounds pretty basic, but we got aggressive about it. And that's what this revamp of the business model is really about. Those are fancy words for great product management looking at where do we play? What are the specific segments? Where do we invest? How do we win? How do we look versus the competition? Where can we differentiate? And then super important, how do we capture the value when we go win against the competition? That stuff is basics of business management and something we're doing extremely well in the organization.\r\nThe third thing, a global transformation of everything that we did in infrastructure, how we build, how we design, how we sell, how we support, how we ship our platforms, we looked at everything. In fact, when we started in, I think there were people that said, hey, you don't want to transform everything at once. We decided everybody is in the organization, this is how we stimulate progress, and we're going to have the entire team help us with the brainstorm on what are the things that we could change to be more efficient and more competitive as an organization. So that led to $1 billion in productivity, which we could invest back in thrilling clients with the things that we were delivering.\r\nAnd then the final thing here, and you'll hear us all talk about it, it's so important, Arvind led the charge with a lot of the culture conversation. This was huge for us. It was the biggest unlock. It was probably the most difficult unlock for the organization. And that was take an organization that had been very successful but didn't believe it could grow and change that whole mindset, get to where we believe we can grow, and we're willing to make the changes and hold each other accountable to do what we need to do to make it grow. And that's been a huge thing.\r\nIn fact, we even did custom leadership training where we talked about leadership style and entrepreneurial leadership and vulnerable leadership and product management and business strategy, et cetera, things that you say, well, as you grow up in the organization, you learn all. You learn all of it but maybe not at the level that when you look at the outside experts in the industry, you can tune some things and you can get a little advantage. I think that's something that was really huge for us. And the beauty of when you do that, when you transform in that way, it is sustainable because now your leaders are operating that way. They have a common vocabulary. This is how they think. They think about how do we win in a given environment, how do we thrill clients, et cetera. So I think that's great. We've accomplished a lot in those 3 years. We're not done. That's what I'm here to tell you.",
        "So I talked about how we changed the organization. How about these growth areas? What I would tell you there -- I talked about how power is stabilized, infrastructure support stabilized. I think our biggest growth area is our Z, Storage, and all of the associated AI infrastructure. And I want to tell you a little bit about each of those.",
        "So this is a Z chart. It shows in the upper left about how we've continued to grow program to program. But if you look, the gray bar is kind of the late in the cycle, the third year of a program cycle, what we're selling in terms of revenue, and so it's even getting stronger later in the cycle. That's because we're introducing more innovation over the life cycle, converting some of that revenue to stream revenue and doing those kind of things to make sure that we continue to have a healthy life cycle all the way through the program. But the biggest unlock to get that kind of results is delivering on client needs. I mentioned those clients that are involved in our design process, they tell us they want more resiliency and security. We give them things like Quantum safe. They tell us they want more hybrid cloud fit. We give them things like Containers and Linux inside of the Z. They tell us they want to address their $500 billion fraud issue in the financial industry, we give them AI to make sure that they can detect fraud in line inside the processors. And immediately, it takes off. In fact, we delivered that to them before there was a ChatGPT moment before the industry was all talking about AI, Z clients were putting AI into action. So that's how we do that. It's resulted in sustained growth. You can look at the MIPS growth. Blue MIPS are the traditional MIPS that are like the old school run your database kind of MIPS. The gray MIPS are the new school MIPS, the hybrid cloud MIPS, Linux Containers, those kind of things. And then probably the thing that I want you to kind of grasp most on that chart is we see a new category of MIPS emerging in Z and that's around AI MIPS.",
        "As we deliver Telum II with new AI capabilities and cards that we plug in to Z processors or to Z systems and into power systems, the Spyre card that we announced, those give us a new value capture methodology. They give us a way to optimize for inferencing for specific workloads that are tuned to databases. So that's another opportunity for momentum for Z going forward. 250-plus of those use cases identified in our clients today where the clients are working on that, many of them in production.",
        "Another thing that's going on in the industry is increased regulation globally for resilience. In fact, in this latest generation Z16, we've sold double the amount of systems for resilience. That's basically having systems that aren't for new transaction volume. If they're sitting in the background, in case something happens, that is a global kind of concern is making sure that the financial systems are resilient and there are regulations associated with that. It's driving demand in Z. So Z is healthy. The great news for investors is every dollar of Z hardware is 3x to 4x that in software stack and consulting, modernization, all those things. So Z, super healthy.",
        "Storage, big opportunity, hardware and software. The 3 things driving this in the industry, exponential growth of data, cyber, ransomware and AI, everything has an AI component to it. Our mainframe storage riding the momentum of the mainframe progress that I just told you, got to store that data if you're going to process it as transactions.",
        "Software-defined. We have numerous offerings in the software-defined space, disrupting traditional arrays, we have software Scale and Ceph that allow you to basically feed and manage the data that you use with AI. We have Defender, which is cyber and ransomware focused and that's shown tremendous momentum for us. And we have new innovations coming from research around content aware storage that we're integrating into our platform.",
        "And just the exponential growth of data means you're going to sell a lot more Flash and you're going to sell a lot more Tape. We sell Tape to hyperscaler vendors. We also now are starting to sell Tape to large customers doing their own models because they want to be able to figure out, okay, what did I put in that model? What's the data that's spit out of it? What are the interim steps? I want to be able to recreate the whole thing. That drives Tape business. So it's interesting. That's a very healthy business for us growing and there aren't many players in the space. So we're doing very well now.\r\nAll this has resulted in a few points of gross profit, improvement in storage, a stabilization of that business, and we're growing it. We've grown faster than the market for 2 years. And in the software-defined storage space that I was talking about, we're growing at 1.5x the market. It's an opportunity for IBM, and we're positioned really well, particularly when you integrate, like Ritika said, with the rest of our software stack and the consulting that goes with it.",
        "So each of those areas already talked about AI, but AI is kind of a great halo on all of infrastructure. You hear about it mostly in software and consulting and here's the opportunity, et cetera. I would say there's just as much opportunity in the infrastructure around AI. You've got to have a way to feed, process, manage and store all of that data. So whether it's inferencing and the Telum inspired chips that I talked about before, we also have an offering in our storage that I would just call hyperconverged for AI in a box so that you can deliver AI to clients in a simple way on-prem, not all clients want to move their AI data or do their inferencing in the cloud. We have a simple solution to enable you to do that on your prem. It's called IBM Fusion, and that's throwing great growth for us, and we're super excited about that product.",
        "Data for AI, Scale and Ceph are feeding and managing data for AI. All that data for AI drives more DS8000 mainframe Storage and Flash. Tape as well, we talked about that. Even in the model space, and there's something in your spare time after the meeting, look up Forbes article around large database models. Everybody in the industry is talking about large language models, LLMs, right? Look up LDMs. It's a new thing. This is about models tuned for databases instead of tuned to be chatbots and things like that. We see transactions there. It fuels AI MIPS. It's the thing I talked about before. It's just emerging. We're just at the forefront of that but we're optimistic about the progress.\r\nAll these customer things I told you about are all of these opportunities aren't just theory. We have clients that are doing them today. Handelsbanken in Sweden scaling now their in-line fraud detection. They had to do everything as a back process. Now they can do it in line, and they're scoring 100% of their transactions where they couldn't come close to that before.",
        "Jülich, Europe's first exascale supercomputer built around NVIDIA GPUs. It's got the Grace Hopper form factor, got to have a way to feed that, got to have a way to manage the data, selling them Ceph and Scale to do that. It's a 21 petabyte Flash module and 700 petabytes of backup capacity. We're selling them Tape as well. Those large-scale opportunities used to just be supercomputer opportunities. Now they're there with every client that's building big models. There aren't not every client is building big models, but a lot are taking an attempt at it, and they have to manage storage and do those capabilities.",
        "The last customer example on here, SiPH. It's the largest -- one of the largest private hospitals in Thailand. Thailand, unfortunately, has a higher incidence of cancer than the global average. So it's a national issue and they're doing -- they're now able to automate cancer screenings on power systems with Scale and Ceph, our storage behind it, and we've helped them in a big way. So we're super happy about that use case.",
        "So this kind of brings it home back to the flywheel. All of those opportunities that I told you about in the Infrastructure with Z, Storage, AI, all of those have watsonx. They have Red Hat containers. They have our consulting expertise to help clients bring it home. All of us working together to deliver a cohesive value proposition. And when you add in the rest of IBM Infrastructure, we really provide the trusted foundation for the rest of the flywheel to rest upon, and we take that job very seriously.",
        "And the message I want to leave you with most of all is, we will continue to grow this infrastructure business, and we'll continue to expand its profitability. So I want to thank you. And Olympia, I think we're about ready for a break."
      ],
      "session": "management_discussion"
    },
    {
      "name": "Olympia McNerney",
      "speech": [
        "Thanks, Ric. So we're going to take about a 10-minute break right now. So we've got refreshment. We've got restrooms. We're going to try and stay on schedule. We're going to come back and get to Quantum with Jay and then the financial model with Jim. So thanks, everyone.",
        "[Break]"
      ],
      "session": "management_discussion"
    },
    {
      "name": "Olympia McNerney",
      "speech": [
        "Well, we are ready to get started again. So let me introduce Jay to take you through Quantum."
      ],
      "session": "management_discussion"
    },
    {
      "name": "Jay Gambetta",
      "speech": [
        "Thanks, Olympia. So I get to tell you about a simple technology we've been incubating called Quantum Computing. So I want to start with the size of this market when it reaches full like tech maturity. BCG have actually done a number of reports, the first one in 2021, and the second in 2024, where they predict that the size of this market will be as large as $500 billion when the technology is a full tech maturity. What they did is they looked at different computational problems, either using computational problems for sparse matrices in machine learning, in simulation, sparse matrices in optimization and sparse matrices in security, and they correlated that with different market segments and estimated how much -- when this technology gets to full maturity, this will return value this will create.\r\nIf we give a couple of examples. Take a computational problem, say in chemistry, that is easily going to have a positive impact in areas in energy, in areas in life science, and in areas in semiconductors. Another example, if you can do a computational optimization or risk prediction or even a simulation, you can have a positive impact in the financial service or in insurance. So at IBM Quantum, well, at IBM in the Quantum team, from day one, our strategy is to make sure as we build this technology, we work with our clients. Shown at the bottom of this slide is various industry clients. We're already working on use cases so we can understand how Quantum is going to impact them as we build this technology.\r\nIf we zoom into our strategy, at the heart we want to build differentiated Quantum processes, Quantum computers. We're going to either deploy them in client sites or deploy them in data centers. We have integrated it with OpenShift, so that from the client lens, whether it's on-prem or in the data center, it works the same way. Built on top of this technology is Qiskit. This is our open source software that is -- you can think of it as the Quantum SDK for programming or how a Quantum computer will work. It's where the quantum developers will go and interact with these future computers. I put this bottom layer and I call this the IBM Quantum platform.",
        "The next layer up is application software. As this technology matures, we have to embed Quantum accelerators with Quantum computers into accelerating application software and libraries. And we imagine in the future of marketplace with various applications that are all accelerated by Quantum Computers. Today, we've started and we've partnered with many start-ups. Actually, 5 start-ups are already integrated with our software, showing how they can do solutions in chemistry, optimization and a few other different problems. And by the end of this year, we're going to double this to 10. So let's call this the second layer.",
        "The third layer is, like I said before, we really want to understand the client problems. So last year, we've worked with industry partners and prototype over 30 use cases showing how Quantum will matter for their business. And then we've also worked with integration partners where we're showing for their client how they can work with their clients to bring solutions of -- bring Quantum Computing to the solutions. So if I will give you the summary, the strategy for IBM for Quantum Computing is to build a platform down the bottom that is differentiated by the computing capabilities to partner in the software space and to partner in the surface space.",
        "So now I want to zoom into the hardware. At the heart of the Quantum Computer is a QPU. I'm not going to teach about physics and supersition and entanglement. There's 2 parameters you should know, number of qubits and number of gates, okay? The number of qubits are essentially the size of the problem you incurred. The number of gates represents the complexity of the quantum algorithm that can be done. The more gates you can do, the more complicated quantum algorithm can be done. And if I was to give you an estimate of estimating the number of gates, the first thing you do is you say, it's basically one over the error rate to give you a proxy for this. So now I can plot this 2-dimensional graph, which I've shown here, number of qubits and error rate. In the dotted line, we call this the utility threshold. If you're below this utility threshold, all those quantum computers can be simulated by classical computers. Once you're above this threshold, you're in this new regime where you can no longer stimulate these. These are now beyond what can be done with classical computers. The further you are, up in the top right corner, away from this, is an indication of how far you are beyond classical computing. So shown in the blue is IBM's QPUs over the last few years with our Heron processor in 2024 as well as our first version of Heron in 2023. And without a doubt, IBM's Quantum Processes are the most performant compared to everyone else. We've sampled every provider of QPUs, the data sheets, papers as well as the specifications of [ map-to-map ] on this plot. So that's one lens. Let's just call that the Role Performance.",
        "The second lens is, if I've got a quantum solution and it's too slow or it costs too much, it's not going to give you advantage in the long term. And so when you think about architectures like Superconducting qubits versus Ions, you can actually show that Superconducting qubits are like 400x to 2,000x faster. And furthermore, using current pricing for the same workload this can be actually up to 70,000x cheaper to run on superconducting qubits. So from the lens of the hardware, the reason we chose superconducting qubits is the most performant and second, they get you the best value.",
        "Now building the quantum computer is more than a QPU. There's cryogenics, classical infrastructure, microwave electronics and you got to put it all together. And you got to put it online 24/7 if you want clients to use it. This means you need reliable quantum systems, automated calibrations, basically continued support and integration in the hybrid cloud. At IBM, we actually have 13 continuously operated quantum computers working today at the utility scale. So at that threshold that I talked about before. Some in our data center in Poughkeepsie in New York, some in our European data center in Germany, and then in client locations around the world. Cleveland Clinic, University of Tokyo in Japan, Yonsei University in South Korea, PINQ in Canada and RPI, a University in the capital region of New York. And we are installing this year the system 2, which is shown at the top. In Riken, a national lab in Japan, in Basque, part of the Basque region of Spain, and at the National Quantum Algorithm Center in Illinois. So IBM is deployed all quantum computers than the rest of the world combined. And if you zoom into this data and ask how many are continuously operated at the utility scale, IBM is the only one.",
        "So I talked -- so we don't want to stop there. We have a public road map. This is public. You can find it anywhere. I'm very proud of 4 things. Well, the 4 things I want to take you through. The first one, we're very proud of. And that is that from the start of putting this road map out, we've executed on every target since 2019 and succeeded in delivering it. The second thing I want to point out is you see this year's system got to that 5,000 gates. We call that the number of operations, the utility regime. We want to continually charting the path from 5,000 to 15,000 in 2028, increasing more and more into that [ utility-scale] region and then having a huge jump to 100 million operations in 2029. This is error-correction kicking in. So that's point two.",
        "Point 3 is when we want to think about error correction, we want to build a code that we can both yield and scale it. So that code has to be modular. We have to be able to make modular memories, modular operations and modular decoders. And so plotted in the innovation road map is exactly that. How we're going to deliver our modular memories with Kookaburra, our modular operations with Cockatoo, and then prototype them with Starling in 2028 to demonstrate error correction.",
        "The fourth thing I want to point out is Qiskit. Qiskit is the software that sits up at the top. It is where you go and you program quantum computers. It is a run time so you can execute quantum workloads really, really fast. And it also works in the middleware because the future of computing is actually going to mix quantum and classical computing together. At IBM, we've chosen to do this open source first. And so I want to jump into that.",
        "Qiskit is, by far, the most popular open source quantum software development kit. A recent survey by the Unitary Foundation said that out of the quantum developers, 74% of them prefer Qiskit. The closest competitor is actually at 47%. Furthermore, our emulator framework, Qiskit Aer, and our exploration of actually using AI to help the population in quantum computing, the IBM Transpiler, are also highly selected. Outside of this survey, we also have Qiskit embedded in over 700 universities. So the next generation of quantum native like developers are going to be brought up using Qiskit. So that's from -- how people prefer the software.",
        "But if you want to get to that application software and get Quantum embedded, it's important that Qiskit is dependent, it's integrated in many software. And so we are very proud of the fact that when we look at the amount of dependence for Qiskit, it compared to every other quantum software has the highest amount of dependent-like programs built on top of it. Over and over again, this is actually what defines winning when you're building a new technology, how much gets integrated and built upon on it.",
        "So I've gone through the lens of the hardware. I hope I've convinced you that we have the most performant hardware. Gone through the lens of the software, we have the most adopted software. And now since we put this program together, we created this network called the IBM Quantum Network. In 2017, it started, and today, it's growing to 280-plus members. And they're all joining us on this vision to bring quantum computing to the market to accelerate, to see where quantum computing is going to matter for different problems. It has over 50 industry members looking -- working on use cases, understanding how quantum is going to impact their business. It has 55 commercial partners that are working on integrating quantum into their solution. It has over 170 research national labs researching quantum algorithms using quantum computers. So put this all together, we have the most performant hardware. We have the most performant software, and we have the largest eco system in the world. And what this has actually resulted in is the total amount of dollars to the IBM business since we're actually -- the amount of signings since we put this program together is approaching $1 billion.",
        "So that is looking at the past. That's where we are. So where are we going? I want to leave you with 4 milestones. These milestones are the key milestones that over the next 4 years are going to determine how much -- how fast quantum comes and impacts in that market I talked about at this time.",
        "The first is quantum and classical. The future of computing is going to be heterogeneous. It's going to have quantum accelerators, classical accelerators. What we need to show is that we can develop that middleware, that programming so that we can run an algorithm either on classical or quantum. We call this quantum-centric supercomputing. We've already shown algorithms where we run with our partners in Riken, where we run quantum computers -- run programs on quantum computers and then run them on Fugaku, one of the world's biggest supercomputers and get results comparable to classical -- the best classical approximations. What we're actually doing this year is installing one of our quantum system 2s right next to Fugaku so we can actually build this architecture. So that's an example of one of the clients. We have many other clients who are working on this architecture with as well.",
        "Second, in 2026, we want to get Quantum Advantage. This is where we do something cheaper, faster or more cost-effective on a quantum or a quantum and classical computer than a classical computer aligned. To do this, we really need to increase the research and algorithms. This is why in the IBM Quantum network, we've partnered with so many national labs, academic universities to do it. One, I want to give you an example of is with UIUC and University of Chicago and many other partners in Illinois, at the end of last year, we announced the National Quantum Algorithm Center. And that is precisely one of the objects of this center is to do that algorithm research based on problems that matter for industries so that we can get Quantum Advantage in the next couple of years.",
        "The third milestone is building an error corrected quantum computer requires an error correcting code that scales and can be yield. That means it has to be modular in nature. So by 2027, we will demonstrate all the parts that are required for a scalable error correction. This is the logical memory, the logical operations, and the [ deconnector ] codes that are all modular in a way so that we can join them together and prototype the first fault-tolerant quantum computer in 2028. This is one of the biggest milestones for the field and achieving this will definitely bring this quantum revolution to the market. Thanks.",
        "Let me pass it over to Jim to take you through the rest of the process."
      ],
      "session": "management_discussion"
    },
    {
      "name": "James Kavanaugh",
      "speech": [
        "Great. Jay, thank you very much. Good afternoon, everyone. I'll tell you what a change just to see this room here packed. I think it talks to how the sentiment has changed around our company. It talks to what Arvind has brought to this company about a fundamentally different focused strategy and it talks about all the IBMers, the few that are in here about the disciplined execution of what we've been able to accomplish over the last few years, but more importantly, about where we're going.",
        "So I'm going to spend some time for the next 30 minutes on here before we get into some Q&A. But hopefully, you could see the excitement of all the presenters that were up here today. Today is a seminal moment again for our company because we're sitting here shaping the future of where we're taking this company as we move forward. Arvind kicked off and each of the presenters, my colleagues have shared one, how we're a radically different company today, focused on the 2 most transformative technological shifts that are occurring in the marketplace today, hybrid cloud and AI. By the way, we've been talking about that 5 years ago, and I think the market is coming our way.\r\nTwo, how each of the components of our business fit together synergistically with a platform-centric model that has a very attractive economic multiplier that we've been able to play out and execute, too.",
        "And finally, three, hopefully, all of you get this flywheel of growth concept that each of the individual segments ended with, it's going to talk about how we win, how we build differentiated value propositions and where Arvind started, I'll end, how we create value for our clients, for IBMers and for all of you as our shareholders overall. So that kind of sets the framework.\r\nSo I'm going to start out right upfront our long-term value creation framework. We're not waiting to the end of the last chart. This is IBM's financial model. And if you take a look at it, it's the next leg of our journey, our journey about how we create shareholder value, which is focused on revenue acceleration. Taking this company with an upward inflection in revenue growth to 5-plus percent durable and sustainable, led by our software portfolio growing 10% overall. That revenue scale plus portfolio mix to a much higher software composition, you couple that with our productivity, by the way, proven capability of productivity, which we'll talk about here in a little while, and it generates a higher level of profitability for our company going forward. And that's going to get instantiated in: one, continued operating leverage and margin expansion moving forward by about 1 point per year; and two, the free cash flow generation engine of our company, growing 2 to 3 points faster than revenue or growing high single digits, to put bluntly. And that free cash flow is going to generate substantial financial flexibility for our company to continue to invest in building out our capabilities around our hybrid cloud and AI strategy, around driving and enabling an attractive return to shareholder program with optionality over time and around maintaining a solid investment-grade balance sheet and capital structure as we move forward. This long-term shareholder value framework summarizes IBM's financial investment thesis: higher revenue growth, higher operating margin company, strong free cash flow yield and an attractive return to shareholder profile.",
        "Let's take a step back. Each of the individual presenters, Arvind kicked off leading about our flywheel of growth. We have spent a lot of work over the last handful of years, aligning our strategy, our business operating model and our financial model around this flywheel of growth. And let me talk a little bit from a specific CFO outcome-based measure of what this 5-year growth has done.",
        "Starts at the top about client trust. Arvind led with this morning or early afternoon. Our incumbency position is hard earned through trust. And you take a look at it today over 80% of our revenue are from clients that buy across all 3 of our segments. Second, we are the de facto platform for hybrid cloud. And we have an early leadership position in Generative AI right now.",
        "Rob talked about 93% of the Fortune 500 clients use IBM's hybrid cloud solutions today. And already 6 quarters in, we have built a GenAI book of business north of $5 billion overall. I would say, an early leadership position in the marketplace. Very important because our clients are choosing who their strategic provider of choice is early in this technology inflection.\r\nThird, innovation. IBM has always been committed to being a high-value innovative provider. And we do that through a very disciplined capital allocation process. And that capital allocation process has enabled over $20 billion of spend through research and development since 2022 that has taken an accelerated growth profile of the IBM business overall, and as I'll talk about later, organically included.\r\nNext, domain expertise. So Mohamad, I think I'm going to use this more than 4x. Why? We have a differentiated competitive position, I believe. And that is we're the only information technology company that brings an innovative technological stack with a consulting business at scale. And any technological inflection, you need domain expertise, industry expertise to drive what we call the tip of the spear, that attractive economic multiplier that we can go capitalize on. That's why it doesn't surprise us in this early shift of GenAI, about 80% of this is getting monetized through a book of consulting first. Yes, we built a software book that's already $1 billion worth but our consulting now has built a backlog north of $4 billion. Very important as we've become that strategic provider of choice.\r\nAnd finally, in any platform-centric company, you have to build out an ecosystem and a set of strategic partners, which my colleagues talked about. And since 2020, we built multiple billion-dollar strategic partnerships. I would argue, Arvind, one of the most underappreciated points that he has brought to this company amongst many things, is he opened up IBM to a strategic partnership. We did not have -- I think one maybe strategic partner that was over $1 billion. We have multiple now, and we've got much more headroom to go. And you started to see this play out in our last midterm model, which we just concluded in 2024. Let me put this in perspective. When we spun off Kyndryl, our last Investor Day, we talked about today's IBM. We talked about our midterm model. And we were coming from a profile that was a declining revenue profile, an incrementally dilutive margin profile annually and a stagnant free cash flow profile. And in 3 years, we have transitioned our company to a durable, sustainable grower and to more disciplined, more efficient company delivering higher level of profitability and higher level of free cash flow generation. And now it's been instantiated based on the strategy that we've put forward, and you see some of that on the right-hand side of the chart. We have capitalized on the shift in the marketplace to hybrid cloud.",
        "You heard from my colleagues, we more than doubled Red Hat's business in 5 years. We 13x our Red Hat OpenShift since pre-acquisition. We built a $16 billion signings inception to date in 5 years in our consulting business around hybrid cloud, around GenAI early in the cycle already north of $5 billion. But we've also been executing a very disciplined portfolio optimization strategy about being focused and that has shifted the composition really to a software-led company. Our software business is now approaching 45%. You dial back pre-Red Hat, we were mid-20s, very big impact to our growth profile, to our margin profile, to our free cash flow profile. And finally, we've been improving the underlying fundamentals of our business. We're getting more disciplined. We're extracting more value, becoming more efficient. And you saw that with $3.5 billion of productivity with an average annual exit run rate by 2024.",
        "And this stronger financial profile is unlock significant shareholder value. We have consistently outperformed since the last 3 years, both the S&P and the S&P Tech. And since the Kyndryl acquisition -- or excuse me, spin out -- we've actually created over $100 billion of shareholder value. But what excites us the most, as you heard from all of my colleagues up here on the stage, about the significant opportunity that is ahead of us.",
        "Why? Because we had momentum. I've always said momentum is contagious, winning is contagious. And you could feel that with each of the presenters that are up here. Momentum has better positioned our company for the future. It's what excites us and what gives us confidence in our financial investment thesis. It enables us to continue to invest significantly and bringing out innovation value around what you heard today, hybrid cloud, AI, automation, data, IBM Consulting Advantage platform, infrastructure next-generation innovation around our mainframe technology coming out in 2025 around our power technology.",
        "And it's also about Jay, who was up here investing in emerging technologies that will place scale and value in the future. And we believe it's not that far off. As you saw inception to date, Quantum already over -- approaching a $1 billion book of business. That has created an alignment to much more high-end growth vectors in our business that has accelerated our growth profile overall. And that has led, as you heard last week, when Arvind and I held our 2024 earnings call, momentum.",
        "And our 2025 guidance reflects that next evolution of where this company is going. If you take a look at it, it's built and fueled off of one, the strength of our software portfolio, the investment in innovation, Red Hat acceleration to mid-teens with opportunity around Linux, around containers, around virtualization, around AI. It's also around the new innovation of a new mainframe cycle coming into 2025. Our GenAI book of business and around our disciplined capital allocation M&A engine that is going to drive significant growth synergies overall. So we have tailwinds in 2025.",
        "That's the confidence and conviction that you heard from Arvind and myself last week which enabled us to guide above the street, both in terms of revenue, profitability, earnings per share and free cash flow. Revenue growth inflecting up to 5-plus percent, continued operating leverage in our business, adjusted EBITDA growing double digits in 2025, leading to a free cash flow engine $13.5 billion that is actually going to grow another point of free cash flow margin year-over-year.",
        "So we feel pretty good all while absorbing as most of you all know, significant dilution impacts in 2025. I think it talks to the diversity of our model and the discipline on how we execute. But 2025 is just the beginning of our model. As I talked about, our shareholder value creation model is built on 3 pillars: revenue growth acceleration, operating leverage driving higher profitability and free cash flow engine creating significant financial flexibility.",
        "Let me dive down now into the revenue growth acceleration as the first pillar of that strategy. Our growth accelerators are actually enabling higher, sustainable, durable revenue moving forward. Yes, we've got tailwinds in '25, but we believe this is just the beginning of that continued upward inflection of what this portfolio and value can actually drive. Why? One, our portfolio mix, which I'll share with you in a minute, is much more aligned to higher-end growth markets overall.",
        "Two, our integrated value. I talked about the power of a platform-centric model, and the attractive economic multiplier that drives off of that platform, that accelerates our growth over time as that book of business continues to get bigger and bigger and bigger. And finally, three, the R&D engine, the innovation engine and the continued disciplined investment that's going to deliver differentiated solutions that will create ROI and value over time.",
        "And you see that on the bottom left of the chart around how that's accelerating our growth across all of our segments, software accelerating to double digits, roughly 10%. Why? Hybrid cloud, AI, automation, innovation value, M&A growth engine and synergies overall. Each of those components are going to deliver that continued acceleration and growth. Our consulting business, we say here market plus -- the consulting market is going through a transition with the technological shift of GenAI, but that market is very attractive, as Mohamad shared with you. Over a long period of time, it's been growing what 4% to 6%, 7%. We believe with our differentiated portfolio in consulting and the levers we have around an early leadership position in GenAI and that multiplier that we can capitalize on, along with our strategic partnerships, which, by the way, we've delivered significant growth over the last 3 years and ramping that up from nowhere, we believe we have a long headroom to go. We're not even in the top 5 league tables across some of our major partners. We're making progress, but I'd tell you that's glass half full and more growth opportunity.",
        "And finally, around infrastructure. Ric talked about it. Three years ago, we couldn't talk about secular growth. We were talking about cyclical growth, of product cycles. The investment in innovation, I think, is now transitioning the next evolution of infrastructure to a secular grower, low single digit over time, led by that innovation of next-generation of mainframe, around storage and the GenAI capability and around, later in this decade, we will start seeing the ramp from a revenue realization of Quantum as we move forward. Each of those will be growth drivers going forward.",
        "So let's take a look at this chart. This is portfolio mix and how it positions us based on moving our -- and aligning our portfolio to higher end growth markets. You dial back to pre-Red Hat. It's only what, 6 years ago. 2018, less than 50% of our portfolio was aligned to higher growth, higher value end markets. We had a lot of work to do. More importantly, our high-value, high-growth software book of business was less than 25% of our portfolio.",
        "You transition that 5, 6 years later, right now, we exited '24. 75% of our portfolio now is aligned with software and consulting higher-end growth markets. It's lifting the boat and why we have the conviction of durable, sustainable growth over time. And our software book of business finished approaching 45%, to be exact, 43%. Tremendous progress from less than 25% less than 6 years ago.",
        "Our model going forward, we see this continuing. Getting the synergistic value of our software and consulting higher-end growth markets approaching 80% of our portfolio. And by the way, that's with infrastructure as a secular grower. And you look at software that is now going to approach 50% of our portfolio, led by hybrid cloud. Red Hat growing consistently mid-teens. I think we've proven over the last 5 years on a compounded growth rate that we can generate that level of growth, especially the opportunity in front of us around virtualization and AI and containers.",
        "Automation, we built up a very powerful strategic lineup of value to our clients around our portfolio. If you think about Instana, Turbo, Apptio, Ansible, Hashi soon to come. We, I think, are second to none in delivering value to automation, and we can think that that can continue to grow double digits. Data, mid- to high single digits. And prudently as we said a week ago, transaction processing mid-single digits overall. So that was portfolio mix.",
        "Let's talk about integrated value. Let's put some numbers to this. You saw it spattered across different presentations earlier today. But I do believe that we have a unique integrated portfolio that can deliver solutions and value to clients, that is differentiated, leveraging a platform-centric model with a very attractive economic multiplier. And you can take a look at what we've actually done over time. These are our 3 platforms across IBM. This is how we run our business. Hybrid cloud, we talked about Red Hat OpenShift, 13x, yes. Every dollar we land on Red Hat OpenShift at a client, we get $2 to $3 of a multiplayer across software and consulting. And we've done that consistently for 5-plus years right now.",
        "GenAI again, differentiated in the only information technology company that has an innovative tech stack and a consulting business at scale. Every dollar we land on our core Watsonx platform, we are seeing now early in the cycle $5 to $6 of a multiplier effect across our software and our consulting business and around our mainframe platform. The most enduring platform overall. Mainframe, by the way, runs the mission-critical workloads. I think Ric talked about 70% of the Fortune 500. Let's bring that home to an industry. 45 of the top 50 banks were mainframe. 9 of the top 10 retailers on mainframe. 4 of the top 5 airlines run mainframe. It is the most enduring platform overall that we continue to invest new innovation. But for every dollar of hardware placement that we land on mainframe, we get 3 to 4x of a multiplier effect across where: one, our transaction processing software; two, our storage attach at the high end; three, our maintenance business, infrastructure support that we stabilized coming out of '24 and about a $5 billion book of business. And four, our financing business, integrated value approach. The combination of this multiplier is an accelerator to our growth as we continue to move forward.",
        "And finally, our organic innovation. We expect long-term sustainable growth. We expect ROI as we invest moving forward. You see here our priority areas around our disciplined capital investment, around organic R&D. Hybrid cloud, AI, critical infrastructure, emerging technology. And if you take a look at it, our organic investment is at $20-plus billion since 2022, we've accelerated our actual organic revenue growth profile by a few points over the last couple of years.",
        "The model, as Arvind talked upfront, we're going to continue to invest in driving that innovation. That's who IBM is, a high-value innovative provider. Our model is going to move to mid-teens on an [indiscernible] perspective. But we are confident in making that investment because of the value creation that we see plays out. We talked about many of these instantiation points on the chart.",
        "Let me just talk about one, that is critical infrastructure on mainframe. That $3 to $4 stack economics, every time I've been out in the last 2.5 years, one of the first questions I get asked, how have you transitioned your growth profile in software? How have you shifted the 45% software composition? And how are you growing transaction processing software? Remember, you dial back to pre-Red Hat, transaction processing software was a mid-single-digit decliner. That's the way we ran the stack portfolio because we would get the hardware placements and we will monetize value very differently. Over the last few cycles, the innovation value that Ric and team has driven into mainframe, our mainframe installed MIPS are up 3x, and this is not a number from a denominator that is very small. This is huge. That's the way we monetize transaction processing software. The more workloads, the more installed MIPS that are being used, the higher renewal rates we get, the more incremental value, and we've taken a transaction processing software from down mid-single to now up mid-single and faster, tremendous movement.",
        "Another critical element of our innovation is around our M&A strategy. It's a key enabler of growth acceleration. And we've been running a successful playbook since the Red Hat acquisition that's built around, as we've talked about many times, 3 criteria: strategic fit, to continue building out capabilities around our platform-centric hybrid cloud and AI model, to synergistic value, product technology synergies, go-to-market synergies, consulting synergies with a very attractive economic multiplier across IBM and; three, that enables an attractive financial profile with free cash flow accretive in 2 years. Our model, as you could see on the right-hand side is about 1 to 2 points worth of growth over time with a capital allocation mix about 75% software, 25% consulting.",
        "So many of you asked what has this delivered over time? I think we have built tremendous credibility since the Red Hat acquisition running this playbook. Our M&A model, if you look at the financial profile, is centered around accelerating our revenue growth profile and around substantially improving and enhancing our margin profile.",
        "On the revenue growth side, our model is to 3x the revenue multiplier in 5 years, split evenly between accelerating stand-alone growth and building those synergistic values of product technology and consulting on top of the assets we purchased. And around enhancing the margin profile, this gets back to the discipline around cost efficiency and operating effectiveness of what we're doing around discipline, due diligence and integration management.",
        "And you see how that has transformed to a much more accretive model over time that we expect and that enables us to have confidence to deliver on our actual commitments around 2-year free cash flow. And you see some of the examples of what we've been able to accomplish. I'm not going to go through all these just for the sake of time. But Red Hat overall, yes, 13x Red Hat OpenShift, but look at the bottom left, we talked 5 years ago when we bought Red Hat, by the way, $34 billion at that time. A lot of discussion about price. I don't think there's a lot of discussion about price right now and the value we've been able to capture in the marketplace. But one thing we talked about was leveraging IBM's incumbency, scale, global breadth. We've entered 28 new countries and now exiting '24, over 50% of Red Hat's revenue is non-U.S., a dramatic difference from pre-acquisition.",
        "Two, Apptio. We're extremely excited about this core asset overall. Leader in ITOps spin-offs. We've been able to generate a significant stand-alone acceleration, growing 25% in bookings over time. And around Neudesic, a consulting asset, that we've actually bought around a Microsoft service provider. We have 4x Neudesic's revenue in 2.5 years, we 3x average deal size, and we've actually doubled the number of clients in Neudesic. I think we've been building some credibility.",
        "The second pillar of our model is around improving the fundamentals of our business and it's around driving operating leverage to drive profitability higher. And if you look at it, operating leverage has always been part of our financial model and our business strategy. We drive operating leverage in this business 3 different ways: one, portfolio mix. Shift in that software book of business to 50% of IBM, higher growth, higher margin, by the way, underneath it, 80% recurring revenue, higher marginal profit dollar. Second, productivity. The investments we make in R&D, in go-to-market, in ecosystem, we expect an ROI on that, and that's how we run it. And third is efficiency and scale is to drive the G&A competitiveness, the world-class benchmarks. And if you take a look at it, we built credibility over the last handful of years of consistently generating operating margin leverage in our business. And we expect this to continue moving forward 1 point per year.",
        "Now you might ask, how are we going to do this? Well, I would tell you, Arvind kicked off today talking about the cultural transformation he has brought to our company. On the one hand, a growth mindset around portfolio optimization, around innovation and R&D, around ecosystem strategic partnerships, risk tolerance and around talent. But I would tell you, on the other hand, he's brought a productivity mindset to this company. Speed, velocity, efficiency, value, client zero, how we take our technology and reinvent the way we run our company that creates a flywheel effect of productivity for us to go invest. And we've got multiple levers, as you could see on the chart, that we can drive as we move forward.",
        "The important thing here is this productivity flywheel effect that we drive $3.5 billion exiting 2024. About 2/3 of this gets reinvested back into the business. 1/3 of it goes to profit margin enablement. And by the way, we've got flexibility to dial that up or down based on individual scenarios and what we're dealing with.",
        "And finally, wrapping up, the third pillar of our shareholder value creation framework, and that is our free cash flow generation engine. Accelerated revenue growth, coupled with continued driving operating leverage delivers substantial free cash flow generation. We exited 2024 $12.7 billion. That's up nearly $3.5 billion in the last 3 years. And we exited with the highest free cash flow margin in the history of our company with consistent acceleration in free cash flow margin with a very efficient balance sheet. I would say, high quality and sustainable and free cash flow realization.",
        "We expect this to continue going forward. We confidently guided $13.5 billion a week ago, another point of free cash flow margin in 2025. By the way, absorbing significant dilution impacts. And we see this continuing as we move forward with free cash flow growing 2 to 3 points faster in revenue, high single digits over time, led by high-quality, strong adjusted EBITDA growth overall, which that free cash flow generation creates significant financial flexibility in our third pillar.",
        "And that enables us to execute our disciplined capital allocation. One, always center around strategic investment in our business organically, inorganically. Two, provide a very attractive return to shareholder program. One, we are a dividend aristocrat. Arvind had it on his chart, 29 consecutive years. We maintain, hold a secure and modestly growing dividend. But this free cash flow engine and the growth of high double -- excuse me, high single-digit free cash flow growth over time on a sustainable basis, our payout ratios on dividend are going to start approaching low 40% in a couple of years. That creates significant optionality. And we will continue to look on how to diversify returning value to our shareholders as we move forward.",
        "And finally, we will continue to maintain a very solid balance sheet, investment-grade capital structure in this company. $15 billion of cash on hand, growing free cash flow high single digit, strong adjusted EBITDA growth is the underpinnings behind that. Remember, every dollar of EBITDA growth creates $3.5 of financial flexibility to our company.",
        "So if you take a look at that, bringing this all together, our shareholder value creation framework really defines IBM's investment thesis. Higher revenue growth company, higher operating margin, strong free cash flow yield and attractive return to shareholder program.",
        "So with that, I'm going to turn it over to Olympia and we'll start getting settled for a Q&A session."
      ],
      "session": "management_discussion"
    },
    {
      "name": "Olympia McNerney",
      "speech": [
        "Great. [Operator Instructions] Why don't we get started with Matt Swanson back there?"
      ],
      "session": "management_discussion"
    },
    {
      "name": "Matthew Swanson",
      "speech": [
        "All right. Thank you. Arvind, last week, you talked about the validation that DeepSeek brought for kind of your philosophy around ROI-driven models. Today, we talked about the cost efficiency. Since then, there's been a lot of talk about the software and application layer of GenAI maybe being pulled forward as people feel more comfortable on the cost side. When we think about the difference between that 26% of customers in production and that 1 billion number of apps in 2028, how much can the shape of that curve changed? And what would that mean to Red Hat as a potential tailwind, but also how those consulting bookings convert into software and infrastructure?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Arvind Krishna",
      "speech": [
        "Yes, it's a great question. So one, on the consulting, that is why you heard Mohamad talk about it, Jim talk about it. We have a lot of confidence that as people see this instead of being a multiyear booking, they're going to turn it into -- get it deployed quick because now we believe we have the ROI and the value because you have a cheaper cost effective way to get at it.",
        "So I think there, it's straightforward. It just translates into all of those signings, turning into quicker revenue in a shorter amount of time than over time. But more importantly, you mentioned Red Hat. It's not just Red Hat. I mean if you look at the AI stack that Matt and Ritika talked about, we see tailwinds on all of that across the enterprise. Because I think what's been holding people up as I call it, it's experimentation to do it, then they come and look at the costs, like I'll give you an example, I had a client who does about 1 billion transactions a day. And to do it if it's multiple cents, even inference cost kind of adds up pretty quick, and they said the math doesn't work. But if we can reduce that by 98%, then actually the math closes and they would jump at it and go get it done. So I think it's tailwinds on the consulting in terms of quicker to revenue and it's tailwinds on the software and probably most exciting across both the RHEL AI piece and the OpenShift AI piece and the Watsonx pieces in particular. Those pieces I think we'll go on after burn as people begin to digest out of that."
      ],
      "session": "question_answer"
    },
    {
      "name": "Olympia McNerney",
      "speech": [
        "Jim Schneider?"
      ],
      "session": "question_answer"
    },
    {
      "name": "James Schneider",
      "speech": [
        "I was wondering if you could maybe give us a sense about -- there's a lot of, I think, excitement among investors about potential M&A opportunities in software. I was wondering if you could maybe address -- I mean clearly, you laid out the road map on M&A. But if you saw a chance for a compelling strategic transformative acquisitions similar to what you did Red Hat all those years ago. How do you think about the scale and scope of what you might reach to achieve? How can you talk about maybe a little bit about the regulatory landscape you see for that? And is the sort of margin piece of it, sort of an inviolate principle in terms of your desire to do M&A?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Arvind Krishna",
      "speech": [
        "I think and I had to unpack that, there's a lot of pieces in there. Number one, look, we have always said and we hold true to that principle. We are not going to be constrained or attracted by just size for its own sake. I just want to be clear about that. Neither it's a constraint, but nor is it necessarily something we run to. I don't know what this would be, if I could imagine what it would be, then we would go do some real work. But if there was something that is transformative, what did Red Hat do? A, it got us into a place where I felt they were going to be 10 years' worth of a tailwind in the business. Actually, I think it's going to be 20, but it was going to be a tailwind. Two, it was an area where clients are going to invest despite us being in there or not being in there. Three, we felt there was a pretty strong moat around the business in terms of how well it was already established.",
        "If you start getting all those pieces, and I'll add one, and it's got to be in a lane where we have credibility with clients. It's not got to be an area where we have to go create credibility, we'd go look at it. We scan the market all the time. I'm not sure what this would be.",
        "On the other hand, let's talk in a more serious way about the -- I think the regulatory environment, and some of you were asking before we started 1:00, I think it will be easier. Easier, doesn't mean easy. You still have to convince the regulator there is no violation of competitiveness. You're not trying to become a monopoly, all those things still hold. And even if the U.S. becomes easier, you still have the U.K., you have for the EU, and I don't think the EU stance has changed a whole lot. All that said, we think that it will be easier in aggregate. And I think that I'm willing to jump through questions and having a rigorous process, so you can get through that in 3, 6, 9 months is reasonable. When it's multiyear I think that that's a drag on the business because then you've got that capital parked out there, and that's not a nice thing to go get done. So I think reasonable acquisitions as we've been doing, will become a faster velocity than has been the case for the last couple of years. I think it's the best answer I can give you, Jim, on that piece."
      ],
      "session": "question_answer"
    },
    {
      "name": "Olympia McNerney",
      "speech": [
        "Okay. Great. How about Amit?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Amit Daryanani",
      "speech": [
        "Amit Daryanani, Evercore. I guess 2 questions. Maybe if you could just help clarify because if I look at the segment data that you gave on growth rate, how do I think about Mohamad talking about consulting growing 6% because do you think you can get to 5% growth with just software and infrastructure. So maybe I'm not doing my math right, but you can maybe just clarify how you really think about consulting growth because it seems to be a bit of a downtick.",
        "And then Arvind, maybe you could just talk about as you think of deploying GenAI internally, Mohamad had this Riyadh Air example. But as you deploy it internally and you have these waves of savings, which could be fairly profound, how do you think about how much do you want to invest to expand your moat, to increase your moat in the business versus returning to shareholders and free cash flow growth?"
      ],
      "session": "question_answer"
    },
    {
      "name": "James Kavanaugh",
      "speech": [
        "Yes. Let's start with the consulting piece. First of all, the 6% overall was one component of the market for consulting. But as I said, up on stage, we believe that the consulting market is long term attractive, anywhere from 4%, 7% growth overall. If you take a look at 2025, we called the first instantiation of the next evolution of our model from growing about low -- the high end to low single digit to now growing 5-plus percent in 2025.",
        "If you look at our model long term, we said 5-plus percent with a little shade up above. We think we can continue to naturally accelerate the growth profile of this company over time. Within an individual year, there might be ups or downs between consulting, what it just went through in '24, in the early indications of '25 because we guided to low single digit, but we think that consulting will ramp up over time, given that GenAI, long-term vector and multiplier, our Infrastructure business is going to grow very nicely with a much new innovation in '25, still grow over its period but that might come down a little bit.",
        "So we've got a model that's diversified, really underpinned by software. At the end of the day, it's a software-led business, and we see that growth continuing to move forward overall. But I would tell you, we called out that first instantiation 5-plus percent. And we only see this business growing faster in the long run. But let's get through '25 first."
      ],
      "session": "question_answer"
    },
    {
      "name": "Arvind Krishna",
      "speech": [
        "Very simple. If you look at the $3.5 million that Jim laid out, that's from end of '22, '22 December is when the baseline date to today. So that was 2 years' worth. All of that is through a mixture of automation and GenAI. Let's just be clear. That's what drove it. Jim's point was, 2/3 of that we put back into growing the business, 1/3 we put into free cash flow. That's the simple answer.",
        "We see that 3.5% increasing. Jim laid out, we see it increasing by at least another 1, 1.5, but that's looking at the next 18 months. If I keep looking longer, this will keep going on. Jim made the point we want to be best-in-class in terms of how we run the enterprise. That's going to carry on. You heard Rob talk about 6% to 7% productivity in developers and software growing to 25% core generation. But Ric didn't talk about it about how we develop the mainframe, how we do chip design. All of those things are beginning to use more and more AI.",
        "Matt, as an example, in his support function where they answer all the calls, on the millions of people who use RHEL has begun to use GenAI to actually create the best answer. We still have people doing it, but that makes the people much more productive because we begin to do that. A lot of that would show up in productivity, but we believe productivity helps you gain market share.",
        "So as opposed to dropping it only to the bottom line because we think what Jim put out, we'll grow free cash flow 2 to 3 points ahead of revenue is healthy. We'd much prefer to use then the remainder in terms of how we grow the business."
      ],
      "session": "question_answer"
    },
    {
      "name": "Olympia McNerney",
      "speech": [
        "How about Ben?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Benjamin Reitzes",
      "speech": [
        "Ben Reitzes with Melius Research. Arvind, by 2029, you should have revenues of about $75 billion plus based on your model and Quantum hits, the Sterling hits. And we were just talking -- and I think each Quantum computer is about $1 billion, right? So I mean, could you sell 7 or 8 of these things and maybe sell some services and have this come out of the gates as a big thing. Or when do we see that kind of revenue?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Arvind Krishna",
      "speech": [
        "Look, I'm not going to quibble with you on the base revenue. You did 5% times 4 years, 20% above. So I got that. And that had very little Quantum baked into it. So let me acknowledge that. That has Quantum kind of at a run rate of where we are today. If I look at achieving Sterling, which Jay put up on the chart, one could have multiple Sterlings, maybe at kind of a price point you talked about. I would just say maybe that's an optionality on IBM as opposed to in our commitments is a fair way to put it."
      ],
      "session": "question_answer"
    },
    {
      "name": "Benjamin Reitzes",
      "speech": [
        "Well, I'm rooting for you. Let's just say that. Also, just really quick, I know that people aren't supposed to do this, but I'm asking a second one because I got to dart out for earnings. Your free cash flow this year is estimated to be about 35% above the net income that the Street is looking for. And we're really focused on free cash flow. But do you see earnings converging towards that $14.60 in free cash flow? Or how should we think about the premium of free cash flow to earnings throughout the multiple?"
      ],
      "session": "question_answer"
    },
    {
      "name": "James Kavanaugh",
      "speech": [
        "I'm glad you asked this question because we've been consistently getting this question over the last 18 months. Post the Kyndryl spin, our free cash flow realization has been running well north of 120%. We just finished 2024, 130%, 132%, to your point. By the way, some of that was the Palo Alto transaction. Overall, there's distortions that will move out. But we believe that the high-quality sustainable level of realization in this company will be north of 125%. Let me tell you why.",
        "Number one, over the last handful years since Arvind has taken over the company, he has aligned our company around a growth mindset and has aligned our actual compensation to much more of a growth equity base. Our stock-based compensation, which, by the way, we do not non-GAAP unlike many of our competitors, is in our numbers, and that has went from about $600 million pre-Arvind, so we just finished $1.3 billion, and it will be $1.6 billion in 2025. That is about 15 to 17 points of that realization delta right off the bat.",
        "Second piece. And hopefully, you got the theme of the entire day today about us being a much more software-led company, since the Red Hat acquisition, we have transitioned our software portfolio from about 25% of IBM to right now approaching 45% with a model to do 50%. That software composition, high growth, high recurring revenue with a growing profile of Red Hat's subscription SaaS businesses, that generates a higher deferred income level every single year. Just like every other software that you would talk to that is high growth. That in of itself is north of 10 points. So stock-based comp being 15 to 17 points over the time period, deferred income is going to be 10, 11, 12 points, you're already at the high 120s. By the way, I would call that high-quality, sustainable, durable cash generation. that creates that flywheel effect for us to have a multiplier of value moving forward. So appreciate the question. Hopefully, that clarifies it over time."
      ],
      "session": "question_answer"
    },
    {
      "name": "Olympia McNerney",
      "speech": [
        "How about Wamsi?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Wamsi Mohan",
      "speech": [
        "Wamsi Mohan, Bank of America. Maybe, Jim, to start with you just on the 100 basis points of PTI margin expansion annually that you're targeting. You obviously overachieved last few years as you think about the next several -- 2025 is guided to north of 50 basis points. Can you maybe put that in context of the 100 that you're expecting down the road? And how much of that is coming from maybe a little more granularity around software mix versus productivity enhancements? And do you anticipate any large productivity actions too?"
      ],
      "session": "question_answer"
    },
    {
      "name": "James Kavanaugh",
      "speech": [
        "Yes. So if you look at it, I talked a little bit about how we manage our company with regards to driving discipline and efficiency around portfolio mix, productivity, efficiency. If you look at -- let's take 2024. We grew gross margins 130 basis points, pretax, 120 basis points, adjusted EBITDA 100 basis points over time. Embedded in that, yes, we had gains on sale of Weather Company. We had Palo Alto gains. We had restructuring. There's always going to be dynamics underneath that, right?",
        "When you take a look at -- but I would call it high quality, high leverage over time, very different company than where we were. And you saw that consistent improvement. You go to '25. We called north of 50 basis points. One, a lot of dynamics playing out in 2025. I think prudent as we start the year that we come out with something that we have high conviction that we can make and beat as we move forward but two, the underlying dynamics in '25, our portfolio shift to a much more higher software content and by the way, new mainframe cycle in '25, that's going to give us about a point a margin leverage at the bottom line in '25.",
        "Mitigating some of that is we have substantial dilution that all of you have been writing about with Hashi. Hashi, we're extremely excited about. The transaction stands on its own with regards to the value and the financial profile, but the impact of both on stock-based comp predominantly and on net interest opportunity costs, that's going to be, I think, I said last week on earnings, about $300 million of dilution. That's 70 to 80 basis points. So that point, a mix benefit we get is going to get mitigated based on that dilution. Now that is front-end loaded in '25 because of the slip of Hashi because dilution has always been in our model. But historically, over time, it's been, what, 30, maybe 40 basis points each year. Now it's going to be 70 to 80.",
        "So what's going to drive that north of 50 basis points in 2025 is going to be the continued leverage of productivity. Gross wise, as Arvind said upfront, we generate consistently -- we believe we still have headroom about 200 basis points of productivity value gross every year. Our model, we've got flexibility dialing up and dialing down. We say over a long period of time, 2/3 of that reinvested, 1/3 of that goes to profit enablement. So when you look at '25 mix about 1 point, dilution mitigates most of that. Productivity will be consistently well north of 50 basis points. Then you get to '26 and beyond, we're back to a reasonable level of dilution. You still get that portfolio mix. That's how you go from 50 basis points in '25 to an ongoing 100 basis points. Hopefully, that answers your questions."
      ],
      "session": "question_answer"
    },
    {
      "name": "Olympia McNerney",
      "speech": [
        "How about Erik?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Erik Woodring",
      "speech": [
        "Erik Woodring, Morgan Stanley. This is for Jim or Rob, just a question on the software business. So the updated outlook for 10% growth, obviously, that's an uptick from the old model. My question is in 2025, you're talking about growth approaching 10% with about 4-ish points of M&A and an ELA cycle. So as we think just beyond 2025 and maybe years where there isn't an ELA cycle or maybe you don't have as much of an M&A tailwind. How do you sustain that software growth? Just looking for a little bit more granularity on how you sustain that."
      ],
      "session": "question_answer"
    },
    {
      "name": "Robert Thomas",
      "speech": [
        "I'll start with operationally what we're doing and then Jim can comment. Growing software is about a few things. One is delivering new products. That's why we spent a good bit of time on the innovation engine, how we built engineering capacity. Software companies don't grow without a lot of new products. And I feel really good about the culture that we've built and the rate and pace that we're delivering products. So that's going to increase. We'll keep doing that.",
        "Second is go-to-market. And we've made a lot of progress in go-to-market, but there's always more to do. We can do more in terms of how we get software deployed quickly, get clients using it and happy with it. That's why we've built this post sales customer success team. So there's still more to do on go-to-market really with our own people.",
        "And then the third lever would be partners. I think we're just scratching the surface of what we can do with business partners not just in the large economies of the world, but also as we go into new geographies where we're expanding, maybe it's Middle East, Indonesia, India, to name a few. There's a lot of untapped potential in countries like this around the world. Most of those tend to be partner-led, I would say. So those are all dimensions that accelerate growth for software."
      ],
      "session": "question_answer"
    },
    {
      "name": "James Kavanaugh",
      "speech": [
        "Yes. Erik, if you put some numbers to it, first of all, to Rob's point, I think we're very proud about what we've been able to do here in repositioning our software portfolio to a much more growth vector compared to where we were pre-Red Hat and over the last couple of years. But when you take a look at our 2025, we've talked about drivers of growth: number one, led by the foundation underlying of our platform-centric model, Red Hat, we see continued acceleration. About a year ago, we were talking 2024 trying to get back to double-digit growth. We had a lot of hard work to prove that. We finished exiting at 17%, growing 12% for the year. We see that continue to accelerate into 2025 just based on the book of business that we've signed, our CRPO, and the tremendous opportunity we see around Linux, containers, virtualization, AI. So Red Hat is going to deliver about 3.5 points of growth in '25 to software. By the way, we consider that pretty sustainable over time in our model, read that 3 to 4 points over time, some years, a little bit higher, but 2025 to 3.5 points.",
        "Two, acquisitions. We will get more. Last year, we got about 2.5 points acquisitive. We did about 6.5 points organically last year in the 9 points. This year, approaching 10%, we're going to get about 3.5 points out of acquisitions. Hashi will give us another point overall in total above. So you get 3.5 out of Red Hat, 3.5 out of acquisition and the rest of our portfolio, our strong recurring revenue, 80% of our business overall, our automation, our data, all that's going to deliver the remaining 2.5 points. Now when you look at that compared to '24, we did 4 points of growth in '24 in that bucket. We did 10% growth for the full year in TP.",
        "I think we were pretty prudently cautious a week ago as we enter 2025 that we said TP sustainably can grow mid-single digit. We're not going to grow 10% every year. That entire 1.5 points is TP. We'll see how the year plays out. We'll see how the mainframe launch goes. We'll see the renewal rates, the mission-critical value. But that gives us confidence on a sustainable basis you're going to get 3.5 plus points out of Red Hat. You're going to get 3 points, give or take, out of acquisitions, and we're going to get 3 to 4-plus points out of our core innovation value that we invest in our business, which gives us that confidence."
      ],
      "session": "question_answer"
    },
    {
      "name": "Olympia McNerney",
      "speech": [
        "How about Brian Essex from the back?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Brian Essex",
      "speech": [
        "All right. A lot of great stuff to unpack here. We'll take a step aside from guidance, and I got a Quantum question. Would like to know how you're working with partners developing on your hardware? Or do you think you might see commercially viable Quantum influence software on your platform before you see like large-scale hardware sales on the Quantum side. And how do you think that would influence kind of the growth profile of the company over the next 5 or so years?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Arvind Krishna",
      "speech": [
        "Let me start and let Jay add. Jay mentioned this place called the National Quantum Algorithm Center in Chicago. So this has got combined investment from the U.S. federal government, from the state government, from University of Chicago, from start-ups who are going to write software. They'll have more than our hardware while we believe our hardware is better. We're actually welcoming that some of the ion-based neutral atom companies are going to put that hardware there.",
        "Those start-ups as well as very large scale companies in the area are going to then write software, trying to exploit multiple hardware. We are 100% confident they'll find that their software goes a lot further on our hardware platform. That means they're not waiting for that moment in '28 or '29. They're getting what you're calling commercial software ready ahead of time. That is the whole point of Qiskit. It gives them a really stable intermediate player. They write to that, so they don't have to worry about the details of the hardware, I'll call it that. and they can exploit multiple hardware platforms, Brian.",
        "As they get there, some of it will be people who create new startups. I wouldn't underestimate if you look at the beginning of this, what some of the really smart people at U Chicago at the National Labs at UIUC, Northwestern, there's a lot of great universities in that area. Plus, they're going to invite people from all over the country to come there. We expect there will be competitions driven both by the state and the federal government to go prove these out. So we think if we are lucky, hundreds, but definitely tens of commercial packages will be ready then when the hardware reaches that next scale. Does that answer the question? And that's one example. What will happen at Riken in Japan is similar. What will happen at Fraunhofer in Germany is similar. So we'll have multiple of these going on to get ready for that moment to be precise."
      ],
      "session": "question_answer"
    },
    {
      "name": "Brian Essex",
      "speech": [
        "Very helpful. But do you think you'll have Quantum influence software that will be able to be run on classical computers before the hardware is available?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Jay Gambetta",
      "speech": [
        "Yes. So -- this is one of the things we are strongly against. So if you are doing these algorithms that Arvind talked about at all these centers that are getting sent around, if you try to run them on classical computers, it actually doesn't work. The best you can do is like 50 qubits and 1,000 gates. So you can't get any idea how it's going to perform. So there's not like this idea where you can have an emulator to test it.",
        "So you have to create this vicious cycle of using the hardware, continuing making the hardware better, building the commercial software that Arvind talked about. And so I see it all being built on top of that. I do see software that will mix classical and Quantum and actually extend the computational reach of Quantum using classical, but it will be combined with Quantum."
      ],
      "session": "question_answer"
    },
    {
      "name": "Daniel Zhu",
      "speech": [
        "This is Daniel Zhu from Bernstein. When I think about sort of the growth framework, 100 -- all else equal, 100 bps of PTI expansion on an 18% margin in company should add like 5% to 6% of PTI growth on top of the revenue growth. But we're kind of guiding to sort of FCF growth, 2% to 3% above revenue, right? So are there any offsets in between those that I should be thinking about? Or is that math just completely off?"
      ],
      "session": "question_answer"
    },
    {
      "name": "James Kavanaugh",
      "speech": [
        "I think you got to go check your math. Revenue growth over time, 5-plus percent, Operating leverage continues to drive 1 point per as you move forward. So you're going to have operating over time. Things you have to put in there; one, what happens to the tax structure over time as far as how that gets down to net income over time. And then we talked earlier about the free cash flow realization over time as we move forward. But in all seriousness, as Arvind has kind of repositioned this company, we are focused on revenue growth acceleration, winning in the marketplace, driving client value that's going to create by the way, we believe, in that order, shareholder value and our second measure, free cash flow. So we are fixated on how we optimize that. By the way, as I said, we're not done driving more and more efficiency out of our balance sheet.",
        "We are not best-in-class right now on the balance sheet side. So there is more to wring out of that balance sheet, and we're going to aggressively go after that. But our 2 measures, revenue growth and free cash flow over time, you're correct in what you said."
      ],
      "session": "question_answer"
    },
    {
      "name": "Olympia McNerney",
      "speech": [
        "All right. I think we're ready to wrap."
      ],
      "session": "question_answer"
    },
    {
      "name": "Arvind Krishna",
      "speech": [
        "Okay. Look, I think what you heard from all of us, and I think to be candid, some of the questions as well, we have a lot of conviction in our business. We have a lot of conviction in the different parts of the business. We also think it's prudent to guide in such a way that we have very high confidence in hitting our guide, which is why some of you are saying, wait a moment, if I add up every optimistic view, it will be higher. But we all know things happen every year. So it's prudent to be able to give a guide that we have very high conviction in hitting. And that's kind of what we are about.",
        "And now, Olympia, we're going to guide them down for demonstrations if you want to meet with a team that does Quantum or does the AI work or does some of the mainframe work and software work, we have a collection and a lot more people down there on the second floor with some food and drinks, right?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Olympia McNerney",
      "speech": [
        "With food and drinks, yes."
      ],
      "session": "question_answer"
    },
    {
      "name": "Arvind Krishna",
      "speech": [
        "With food and drinks for those who want it. So that's out there on the second floor, and we look forward to interacting more with you over there."
      ],
      "session": "question_answer"
    },
    {
      "name": "Olympia McNerney",
      "speech": [
        "If I could ask you guys to just hold on for one second. Our management team is going to move down to the second floor quickly, and then we can all head down there together."
      ],
      "session": "question_answer"
    }
  ],
  "year": 0
}