{
  "id": "WMT_3412733",
  "participant": [
    {
      "name": "Charlie Anderson",
      "description": "executive",
      "role": "executive"
    },
    {
      "name": "Richard Cohen",
      "description": "executive",
      "role": "executive"
    },
    {
      "name": "Bill Boyd",
      "description": "executive",
      "role": "executive"
    },
    {
      "name": "Carol Hibbard",
      "description": "executive",
      "role": "executive"
    },
    {
      "name": "Matt Summerville",
      "description": "analyst",
      "role": "analyst"
    },
    {
      "name": "Joseph Giordano",
      "description": "analyst",
      "role": "analyst"
    },
    {
      "name": "Colin Rusch",
      "description": "analyst",
      "role": "analyst"
    },
    {
      "name": "Robert Mason",
      "description": "analyst",
      "role": "analyst"
    },
    {
      "name": "Greg Palm",
      "description": "analyst",
      "role": "analyst"
    },
    {
      "name": "Guy Hardwick",
      "description": "analyst",
      "role": "analyst"
    },
    {
      "name": "Kenneth Newman",
      "description": "analyst",
      "role": "analyst"
    },
    {
      "name": "Mike Latimore",
      "description": "analyst",
      "role": "analyst"
    }
  ],
  "quarter": 0,
  "symbol": "WMT",
  "time": "2025-01-16 13:01:00",
  "title": "Special Call - Walmart Inc.",
  "transcript": [
    {
      "name": "Operator",
      "speech": [
        "Good day, and thank you for standing by. Welcome to the Symbotic to Acquire Walmart's Advanced Systems and Robotics Business Conference Call. [Operator Instructions] Please be advised that today's conference is being recorded. I would now like to hand the conference over to your speaker today, Charlie Anderson, Vice President of Investor Relations. Please go ahead."
      ],
      "session": "management_discussion"
    },
    {
      "name": "Charlie Anderson",
      "speech": [
        "Hello. Welcome to Symbotic's webcast to discuss its agreement to acquire Walmart's Advanced Systems and Robotics Business. I'm Charlie Anderson, Symbotic's Vice President of Investor Relations. We have filed both a press release and an accompanying slide presentation on the transaction, both of which are available on the Investor Relations section of our website at ir.symbotic.com.\r\nOn today's call, we plan to reference slides in the presentation if you want to follow along. Some of the statements that we make today regarding our business, operations and financial performance may be considered forward-looking. Such statements are based on current expectations and assumptions that are subject to a number of risks and uncertainties. Actual results could differ materially. Please refer to our Form 10-K, including the risk factors. We undertake no obligation to update any forward-looking statement. ",
        "On today's call, we are joined by Rick Cohen, Symbotic's Founder, Chairman and Chief Executive Officer; Bill Boyd, Symbotic's Chief Strategy Officer; and Carol Hibbard, Symbotic's Chief Financial Officer. Rick, Bill and Carol will give an overview, and then we'll move to Q&A. ",
        "With that, I'll turn it over to Rick to begin. Rick?"
      ],
      "session": "management_discussion"
    },
    {
      "name": "Richard Cohen",
      "speech": [
        "Thank you, Charlie. Good morning, and thank you for joining us to review this exciting transaction. As you saw from our press release today, we have agreed to acquire Walmart's Advanced Systems and Robotics Business. For us, this is a transformative deal and that it extends our automation technology downstream of the distribution center to the store level to fulfill the growing number of e-commerce orders for customer pickup or last mile delivery. ",
        "This transaction gives us arguably the industry's broadest portfolio of supply chain automation solutions while deepening our relationship with Walmart. Walmart shares our vision for transforming the supply chain, and we are playing an essential role today by automating their 42 regional distribution centers in the U.S. with our A1-enabled software and robotics platform. As the companies discuss the next logical step to reap the benefits of automation, given our success thus far, it became clear that Symbotic was a natural partner to help Walmart move faster to expand its accelerated pickup and delivery or APD capabilities. ",
        "For those familiar with the APDs -- for those unfamiliar with the APDs, they are online pickup and delivery centers occupying a space in the back of the store. Across 3 temperature zones, they store tens of thousands of items that can be picked by robots to fulfill online customer orders for pickup or last mile delivery. Walmart has done a limited deployment of the APDs thus far and came to us last year to see if we could enhance what they've already built. When we demonstrated to Walmart how our A1 enabled software could deliver outcomes not previously possible to the APDs, it set us down the path we are discussing today. ",
        "This is truly a mutually beneficial transaction in that it expands Symbotic's product offerings to include micro fulfillment for each picking. This brings us downstream to e-commerce centers that enable pickup or last mile delivery, and it allows Walmart to leverage our long history together to move faster in expanding their APD capabilities.",
        "Along with the acquisition, we have agreed to a new commercial arrangement with Walmart covering this new product offering. Under the terms of the agreement, Walmart is funding a rigorous technology development program to enhance current online pickup and delivery fulfillment systems as well as design new systems to meet current and future customers' needs. ",
        "If key performance criteria are met, Walmart is committed to developing our technology in hundreds of stores over a multiyear period, which could increase our future backlog by over $5 billion. Stepping back, I often use the analogy that our software and robotics platform is like an operating system upon which apps are created to automate different aspects of the supply chain. The first application for us has been in the traditional warehouse, first with our pallet-based system and then with our BreakPack system. Think of today's announcement as you have another application, bringing us all the way down to the customer order level. ",
        "With that, I'll turn it over to Bill Boyd for more details. Bill?"
      ],
      "session": "management_discussion"
    },
    {
      "name": "Bill Boyd",
      "speech": [
        "Thank you, Rick. I'm going to start with an overview of Walmart's Advanced Systems and Robotics Business, which you can see in detail starting on Slide 3. With this transaction, we're adding a last-mile automation system that revolutionizes fulfillment from a store level. As you can see from the photos here, Walmart today is taking a portion of the back row of its store and then adding a miniaturized automation system that quickly retrieves products to fulfill individual customer orders for either customer pickup as shown on the bottom right, or for last mile delivery.",
        "Now let's discuss where this all fits into our larger strategy, turning to Slide 4. With this acquisition, we now have products that touch goods throughout the supply chain.  From ingesting pallets originating from upstream suppliers all the way to preparing an order at a store for a customer pickup or delivery. And all of this will be powered by our AI-enabled proprietary software that we believe will drive efficiencies not previously possible in the supply chain. ",
        "Turning to the strategic rationale on Slide 5. We see bringing automation to the store in local level as a natural extension of our core technology and strategy. And as Rick noted, the new commercial agreement with Walmart could increase our future backlog by over $5 billion if key performance criteria are achieved following a rigorous technology development program. ",
        "Symbotic has become a trusted partner for Walmart and importantly, this deepens an already strong relationship. Extending into this new product category also creates incremental customer opportunities not previously available to us and expands our addressable market, which I'll cover in a moment. And we see it adding to our end-to-end platform for delivering high efficiency and accuracy while accelerating the development of robotics and AI in the supply chain. ",
        "Lastly, we expect the transaction to enhance our long-term growth and profitability profile. In terms of what this does for customers, as you can see from Slide 6, industry leaders like Walmart have already begun the journey of utilizing their brick-and-mortar footprint to enable a fast-growing e-commerce business. We see an automation solution as a critical tool to accelerate this trend and transform the retail landscape. ",
        "Turning to Slide 7. This expands upon our already sizable addressable market, as I mentioned earlier, based on a $2.6 trillion e-commerce market in the U.S. by the end of the decade, and an estimated 50% of which could be satisfied by store and local fulfillment. We see over $300 billion of incremental opportunity in the U.S. alone for us between onetime system sales and recurring software over a typical term. As we stack up these opportunities, we continue to believe that automating the entire supply chain could be one of the largest addressable markets in the world. ",
        "Now to discuss the financial aspects of this transaction, I'd like to turn to Carol Hibbard. Carol?"
      ],
      "session": "management_discussion"
    },
    {
      "name": "Carol Hibbard",
      "speech": [
        "Thanks, Bill, and thanks to everyone on the line for joining us today. Financially, this is a great transaction for us. We believe the acquisition and commercial agreement combined to bring us a business with compelling long-term financials and limited near-term risks. ",
        "Turning to Slide 8. I'm going to discuss how we expect this to play out in the coming years. Over the next few years, Walmart is funding a rigorous technology development program, leveraging Symbotic's Robotics platform to enhance online pickup and delivery fulfillment system. Associated with this program, Walmart is paying Symbotic a total of $520 million, including $230 million at closing, which we expect to result in positive free cash flow while allowing us to expand our product portfolio. ",
        "After the development phase provided that performance criteria are achieved, Walmart has committed to a deployment phase of 400 systems over a multiyear period and Walmart has the option to order 200 more. The business model of deploying systems for the APDs is similar to our current business model and that as systems go live, we were able to earn high-margin recurring software and maintenance revenue. Overall, we see this business as accretive to our margins. Longer term, as Bill mentioned, there is a very large addressable market to go after. ",
        "Notably, 87% of retailers are already offering a buy online pick up in store option and Walmart has demonstrated that half of its e-commerce items can be fulfilled by its stores, and this is all before reaping the benefits of large-scale automation.",
        "Turning to the summary on Slide 9. We detail here all the aspects of the transaction. Overall, we are paying $200 million at closing with an additional $350 million contingent upon the number of systems that are ordered in the future. The commercial agreement includes the development phase over the next few years, followed by deployment phase of hundreds of stores over a multiyear period. ",
        "During this deployment phase, we expect to recognize system revenue and recurring revenue similar to our current distribution center model. And our annual recurring revenue under this deal includes software license fees with performance incentives. In terms of financial impact, we expect the transaction to be accretive to our revenue, margins and free cash flow.",
        "Wrapping up, we are targeting to close the transaction in the second quarter of fiscal 2025.",
        "With that, operator, we can begin the Q&A."
      ],
      "session": "management_discussion"
    },
    {
      "name": "Operator",
      "speech": [
        "[Operator Instructions] Our first question comes from the line of Matt Summerville with D.A. Davidson."
      ],
      "session": "management_discussion"
    },
    {
      "name": "Matt Summerville",
      "speech": [
        "A couple of questions. First, I want to be clear, is this something that -- this APD system, is this something that will be exclusive to Walmart for a certain period of time? I guess I'm curious as to what your out-of-the-gate ability is to go after this new $300 billion TAM? And then I have a follow-up."
      ],
      "session": "question_answer"
    },
    {
      "name": "Carol Hibbard",
      "speech": [
        "So I'll start, Matt. So as we filed our 8-K this morning, you'll see in there that we do have some exclusivity and so when we think about what's in store for us for the next couple of years, it will be a development phase that we're engaged in. And then our key commitment near term is for our agreement with Walmart that we just signed. And so as we ramp up over the coming early years, we'll be focused on that. ",
        "However, this business is really about the long term. And over the long term, that exclusivity will allow us to -- will fade off and we'll be able to address the TAM as we go forward into the market."
      ],
      "session": "question_answer"
    },
    {
      "name": "Matt Summerville",
      "speech": [
        "Got it. And then I was wondering if you can maybe help expand a little bit on what the margin structure of the systems look like? And as a percent of system cost, what you expect that recurring revenue flywheel to look like as well?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Carol Hibbard",
      "speech": [
        "Yes. So this deal will be accretive to our current Symbotic margins. And so one of the key things on here, if you think about our existing structure, it will be very similar. We'll have system revenue and we'll have recurring revenue. We've structured our contract in a way that we are rewarded with performance escalators. And so while we're creating value for our customer, we'll also be able to capture that value related to performance incentives. And so Matt, think about it as accretive in terms of overall gross margin. ",
        "In addition, our recurring as a percent of the overall systems will be better than what you see in our current MAA and that recurring as a percentage of systems also has performance escalators that allow us to grow that as we beat some of the incentive criteria."
      ],
      "session": "question_answer"
    },
    {
      "name": "Operator",
      "speech": [
        "Our next question comes from the line of Joe Giordano with TD Cowen."
      ],
      "session": "question_answer"
    },
    {
      "name": "Joseph Giordano",
      "speech": [
        "How does this work with like BreakPack because I think you guys were bringing in BreakPack to kind of fulfill buy online pick up in store, direct from the DC. We saw that at the Investor Day. So just curious how like this new technology is complementary to that."
      ],
      "session": "question_answer"
    },
    {
      "name": "Richard Cohen",
      "speech": [
        "So right now, in the future, we may choose to use BreakPack optionally to fulfill the -- our APD systems in the back of the store. But we don't -- but initially, we'll deliver directly to the store and they'll fill the system. But I think what your question is asking is all is sub connected and eventually it will all be connected so that you could receive a product in the warehouse, put it in a tote and BreakPack, ship it to the store and they could fulfill the back of the store system and take even more labor and lower the cost of getting that each to the customer. So that's holy grail that we're shooting for, but we're not there yet."
      ],
      "session": "question_answer"
    },
    {
      "name": "Joseph Giordano",
      "speech": [
        "And then how would you respond like when you guys are kind of going on your journey with getting the legacy system to the final specs that you're happy with? And what about bringing on what seems to be kind of like a lot of excess complexity at the time when you're trying to simplify. I understand the long-term opportunity here. But like at this point in time, it does bring on a lot, but you guys have to deal with when you're already dealing with a lot. So how would you kind of respond to that?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Richard Cohen",
      "speech": [
        "Yes. So that's a fair question. And so one of the things that we worked with Walmart over the last 6 months is actually most of our operating system is very applicable to a small system in the back of the store. These systems are going to look like a mini Symbotic system in a warehouse. And so the software, there's some additional software, but -- we've already started working with Walmart on the integration layer, which they already have for the system for the company that we're buying, the Walmart System and Robotics Business. So a lot of this stuff is done. ",
        "We also have brought on some new talent here, and we expect to actually get some talent from the Walmart team, which is also like 10 minutes from here, by the way, in Andover, the Walmart Advanced Systems and Robotics Business. So this is a very collaborative synergistic opportunity. And a lot of the work is all done. We're just enhancing what Walmart started, and they believe that we can go faster.",
        "So of course, there's some additional complexity in any time you grow, there's some. But we actually have a very good team in place, a lot of the technology, we know it just needs to be improved. So I don't think it's that much added complexity compared to the opportunity in front of us. It's just -- it's a no-brainer."
      ],
      "session": "question_answer"
    },
    {
      "name": "Joseph Giordano",
      "speech": [
        "And Rick, if I could just -- can I clarify, does this deal include like the alert innovation technologies that Walmart already own?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Richard Cohen",
      "speech": [
        "Yes. That's -- they don't call it that anymore. They call it Walmart Advanced Systems and Robotics Business, but that's what we're buying."
      ],
      "session": "question_answer"
    },
    {
      "name": "Operator",
      "speech": [
        "Our next question comes from the line of Colin Rusch with Oppenheimer & Company."
      ],
      "session": "question_answer"
    },
    {
      "name": "Colin Rusch",
      "speech": [
        "Can you discuss any incremental robot dexterity IP that you're going to be receiving as part of this deal, just in terms of your ability to handle -- handle packages and supplement the BreakPack functionality they have."
      ],
      "session": "question_answer"
    },
    {
      "name": "Richard Cohen",
      "speech": [
        "Yes. So our system has a different architecture than what used to be the alert and now is the Walmart System and Robotics. So the Walmart Systems have a climbing bot, ours we think that we can use that plus our horizontal bot, which is much faster. And what's interesting is that the only 2 people that have the patents on transfer decks, which we originally gave to Walmart so that they could use. We're now actually we'll be the only people in the world that have the ability and the IP for a transfer deck. And so we will gain some additional technology and that their bots climb and our bots go very fast horizontally, the merging of those 2 technologies doesn't exist anywhere in the world."
      ],
      "session": "question_answer"
    },
    {
      "name": "Colin Rusch",
      "speech": [
        "Super helpful. And then from -- I know it's early days, but from a learning cycle perspective, how are you seeing the micro fulfillment data impacting your overall efficiency of the broader Symbotic system? And how quickly can you integrate some of that information and to improve performance."
      ],
      "session": "question_answer"
    },
    {
      "name": "Richard Cohen",
      "speech": [
        "So this is what makes this so special because we've been working with Walmart for 6 to 7 years. We actually understand their base systems. So it normally take 2 years to integrate. For us, I think it will take 6 months. So we actually know how to integrate the Walmart data into a micro fulfillment center, which is not -- which is different, but not too dissimilar to managing the Walmart information in a warehouse.",
        "So in a warehouse, you get a store order and in a micro fulfillment center you got a customer order, how you handle those is not too different because we both designed our systems to integrate. Walmart designed theirs and we've designed ours to integrate big orders and small orders. So that was a big unlock for Walmart when we showed them how the technology that we've developed in handling -- and we already handle tote. So most of the micro fulfillment centers in the back of stores handle some kind of tote. So we've done a ton of work on this. And -- so I think the integration will go smoothly and happen quickly."
      ],
      "session": "question_answer"
    },
    {
      "name": "Operator",
      "speech": [
        "Our next question comes from the line of Rob Mason with Baird."
      ],
      "session": "question_answer"
    },
    {
      "name": "Robert Mason",
      "speech": [
        "I guess first question. Carol, could you speak to how the -- what we should expect in terms of impact on your P&L during the development phase?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Carol Hibbard",
      "speech": [
        "Yes. Rob. So I'm assuming you're talking about revenue and gross margins. So we're in early days. And so as you can imagine, this is a complex transaction as we go through the next couple of weeks to close.  You'll hear more in terms of immediate impact when we release our financials here in the next few weeks in the first quarter. But stepping back from that, we expect system deployments to start within the next 3 years. But prior to that, we'll have this rigorous development phase, which is funded by the customer. And so therefore, we expect to have additional revenue and profit tied to that level of activity in that 3-year window.",
        "As we're working through our revenue recognition, this will be over an extended period of time. So a portion of that revenue may be deferred. So in other words, as we announced, we'll get $230 million of cash upon close, but very similar to how we've structured our other arrangements, we've structured cash favorable terms. So I wouldn't model $200 million of revenue in 2025,  it will be spread over a longer period of time. But we do expect we'll have -- even in the near term, we'll have accretive revenue, accretive profit and then overall accretive gross margins. And then as we deploy, I mentioned earlier that this is accretive to our overall profile going forward."
      ],
      "session": "question_answer"
    },
    {
      "name": "Robert Mason",
      "speech": [
        "Understood. And then just as a follow-up question, just conceptually, again, I'm still trying to grasp the incremental capability you've acquired with a micro fulfillment system. Does the $300 billion incremental addressable, yes, that's in-store micro fulfillment, as I understand it. Is there still an opportunity to have a micro fulfillment system deployed in the distribution center environment for e-commerce fulfillment? Or are we covering that within the spectrum of your TAMs that you've outlined?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Bill Boyd",
      "speech": [
        "Sure. I can talk about the TAM. So the answer is we built the TAM up, as we said, by looking at all e-commerce volume at the end of the decade, cutting that in half. And then -- so there is a discount in there for -- on the overall addressable market, as you said. And yes, we focused only on the U.S., and we have focused on back of store. So the other alternatives that you laid out, things like doing it in a distribution center, overall e-commerce as a whole certainly could be accretive to that TAM, but we have focused on what we know is in front of us today. To the extent we also go internationally, that would be an increase to the TAM, and we would come back to you with those numbers as we attack them."
      ],
      "session": "question_answer"
    },
    {
      "name": "Robert Mason",
      "speech": [
        "Would -- just as a follow-up to that. Would this have applicability within a green box deployment scenario, maybe we're getting too far ahead of ourselves, but is this an opportunity there as well?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Bill Boyd",
      "speech": [
        "I don't think you're getting too far ahead of ours -- we're not getting too far ahead of ourselves by talking about it. It's certainly something that we intend to explore and  there's no reason to believe that if multiple retailers are in a building and are shipping downstream that they might want to consider doing that as an e-commerce as well as to stores. So that's something that will be explored in the future, but not counted on at this point in our TAM no. Sorry, not counted on at this point."
      ],
      "session": "question_answer"
    },
    {
      "name": "Operator",
      "speech": [
        "Our next question comes from the line of Greg Palm with Craig-Hallum."
      ],
      "session": "question_answer"
    },
    {
      "name": "Greg Palm",
      "speech": [
        "Yes. I would be curious if you could go into detail a little bit more about the milestones. I think, Carol, you talked about kind of a 3-year development period. But what is the milestone sort of entail at the end of that and sort of throughout this whole process?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Carol Hibbard",
      "speech": [
        "Yes. So I'll start. We'll go through a 3-year development. The key milestones will be acceptance of our first delivery of that store. And so upon -- that will be what we're calling a triggering event related to the next outflow in terms of the purchase agreement. And so we'll go through a development period here for the next 2 to 3 years. And then upon acceptance of that first system, that will trigger the second outflow of cash of the $175 million related to the purchase.",
        "But that also triggers us beginning to recognize backlog on those 400 stores. And so then the next kind of key milestone will be Walmart's second triggering event is they have the ability to order an additional 200 stores and that will trigger some time during the rollout of our 400. So that's their option for the additional 200."
      ],
      "session": "question_answer"
    },
    {
      "name": "Greg Palm",
      "speech": [
        "Okay. And I guess in terms of the acceptance, what kind of sort of criteria is that based on?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Carol Hibbard",
      "speech": [
        "Yes. And so I'll start and then if you want to get more into the technical detail, Rick can chime in. But the specific performance criteria that we need to hit for that milestone is confidential with our customer. But as you can imagine, they are focused on significantly improving the time that it takes to pick an order. And so we'll be measured on that efficiency and that will be how we move forward into the next phase. ."
      ],
      "session": "question_answer"
    },
    {
      "name": "Greg Palm",
      "speech": [
        "Okay. That makes sense. And my sort of last, I guess, second follow-up, if I can. Walmart has a lot more than 600 stores. I'm just curious, is this applicable to the entire footprint? Or is there just a certain number of stores that eventually they are wanting to automate with this capability?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Richard Cohen",
      "speech": [
        "So they have identified at least 600 stores that this system would go into. And part of our development may be to build a bigger system. We may -- they may ask us to build a smaller system to go into even more stores. But it was more a function of  how many stores could you do this no-brainer wise? And how big is that contract? And when we got to $5 billion in 600 stores, I think we both said that's a good place to start.",
        "And so -- but this is -- this is -- these systems are incredibly flexible. We can build them bigger, we can build them smaller, and that's what we're going to be working on. So my guess is this is just the beginning."
      ],
      "session": "question_answer"
    },
    {
      "name": "Operator",
      "speech": [
        "Our next question comes from the line of Guy Hardwick with Freedom Capital Markets."
      ],
      "session": "question_answer"
    },
    {
      "name": "Guy Hardwick",
      "speech": [
        "This is Guy Hardwick. Sorry, I just -- I was just cut off for a second. So Carol, the $520 million that Walmart will pay Symbotic is that spread over 3 years for the development program and how would you account for that? Is it accounted as R&D revenue?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Carol Hibbard",
      "speech": [
        "Yes. So we're working through -- that will be spread over a multiyear period. And so as we're working through our revenue recognition model, a portion of that you'll see in the first 3 years. But there's also a portion as we work through how that rev rec will work that could be deferred over the delivery of the 400 stores, but there will be initial revenue since its funded development as we're doing the activities associated with the development as well as building up several proof of concepts during that period."
      ],
      "session": "question_answer"
    },
    {
      "name": "Guy Hardwick",
      "speech": [
        "And in terms of what kind of teams or numbers of people, particularly engineers and technical people you're bringing over from Walmart or are you just acquiring the technology?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Richard Cohen",
      "speech": [
        "We're in the process, when we're done here, we're going over and meet that team, a lot of them for the first time, and we'll be doing an interview process, and we'll take as much talent as we can. And so we haven't made that decision yet."
      ],
      "session": "question_answer"
    },
    {
      "name": "Operator",
      "speech": [
        "[Operator Instructions] Our next question comes from the line of Ken Newman with KeyBanc Capital Markets."
      ],
      "session": "question_answer"
    },
    {
      "name": "Kenneth Newman",
      "speech": [
        "Congrats on the announcement.  Maybe for my first question, so this APD technology isn't really something that you've highlighted as much in recent quarters? I know you've been working on looking at other applications, maybe in the non ambient systems or expanding BreakPack. I'm just curious how you think about ramping your capacity from a management and engineering perspective, while still being able to kind of drive research and development in those other initiatives?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Richard Cohen",
      "speech": [
        "So what's so special about this is we don't tell you everything that we do. We're not supposed to. But -- this is -- this system will have frozen and perishable in the system. And so -- and basically, the beauty of what Symbotic is doing is we get customer requests to develop stuff. And so if you think of what most automation companies are doing and they're trying to make something and then sell it. And because of the special relationship with Walmart and the trust that we've developed over the years, they come to us often times now and say we have a particular problem. We think that you are the best people in the world to solve this problem. And so -- we -- and there's a lot of overlap. So we think this is very well within the product development cycle that we're looking for. We think this is an extension of what we already do. There'll be some new stuff. There's always some new stuff. But we don't think this is not a different business for us. This is just an extension of what we already do."
      ],
      "session": "question_answer"
    },
    {
      "name": "Kenneth Newman",
      "speech": [
        "Yes. That's helpful, Rick. I guess as a follow-up to that, I mean, 400 deployment is a lot more than the 44 that you have in process today in the legacy warehouse side. I mean is this going to require a material change in how you think about addressing installation, whether it's through the EPCs or just your engineering labor currently?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Richard Cohen",
      "speech": [
        "Yes. So as you know, it's been a journey for us to get to the amount of deployments we've done, but we're really good at it now. And so one of the things -- one of the things that's special about this transaction is everybody in the world that makes anything that goes into a warehouse goes and pitches it to Walmart. And so for Walmart to come to us and say, we've seen everything there is, we even own some stuff, and we think you're the best one to solve this problem.",
        "And by the way, we're actually pretty happy with the way that you're installing these big couple hundred thousand square foot systems. So what's special to me and the reason we're so focused on customers is this customer, which is the largest warehousing customer in the world is saying, your capabilities for installation, software development and problem solving are the best in the world. That's why they picked us.",
        "So we are very, very focused on how we would install these systems. But the journey that we've been on for the last 5 years of getting better at installing systems. So these systems will be designed for very, very fast installation. They'll be preassembled. So we've already started doing that work. We'll learn more from the Walmart Robotic Systems, but we've done a lot of work on structures, on bots, on resiliency and quick installation. So we think this is right in our sweet spot."
      ],
      "session": "question_answer"
    },
    {
      "name": "Kenneth Newman",
      "speech": [
        "Yes. If I could just squeeze one more in. Carol, I just had a quick clarifying question on the development phase. You gave some good color on how to think about rev rec over that time period. But just to be clear, during the development phase, we shouldn't think that these development revenue, whatever you recognize in that period is not going to be gross margin dilutive from the get-go. Is that correct?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Carol Hibbard",
      "speech": [
        "That's correct. It will be accretive from the..."
      ],
      "session": "question_answer"
    },
    {
      "name": "Operator",
      "speech": [
        "Our next question is a follow-up from Joe Giordano with TD Cowen."
      ],
      "session": "question_answer"
    },
    {
      "name": "Joseph Giordano",
      "speech": [
        "I just wanted to clarify again on like the rev rec here. So this development, the R&D funding will show as revenue. And will it like -- will this flow as like systems revenue? Just wanted to understand like where we should expect to see it and how it's going to like -- like I guess in a way you can kind of change the way that we think about like revenue per system in development, right?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Carol Hibbard",
      "speech": [
        "That's right. Yes. We're working through the final of where you're actually going to see it show up in the financials, but you should expect it to flow in the systems line and then as we start deployment, we'll have systems revenue as well as recurring revenue, very similar to our existing methodology."
      ],
      "session": "question_answer"
    },
    {
      "name": "Joseph Giordano",
      "speech": [
        "And is that -- the recurring pull on the software, I think you said it's accretive. Is that accretive to like the existing Walmart contract or to what you're like currently selling to a new customer, Symbotic for legacy?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Carol Hibbard",
      "speech": [
        "So it's accretive to existing Walmart customer. It will be accretive compared to what all of our other customers combined as we go forward. So as I mentioned, how we've structured this is very performance incentivized. And so we've got figures to be able to provide value, and we'll share in that value going forward."
      ],
      "session": "question_answer"
    },
    {
      "name": "Operator",
      "speech": [
        "Our next question comes from the line of Mike Latimore with Northland Capital Markets."
      ],
      "session": "question_answer"
    },
    {
      "name": "Mike Latimore",
      "speech": [
        "And just to be clear, is the $5 billion of potential backlog, does that relate to 400 stores or 600 stores?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Carol Hibbard",
      "speech": [
        "Yes. The $5 billion of backlog relates to the development period and then the first 400 stores."
      ],
      "session": "question_answer"
    },
    {
      "name": "Mike Latimore",
      "speech": [
        "Got it. And then can you just provide a little more clarity around the functionality you're buying and developing here relative to BreakPack? And does this change any strategy around BreakPack?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Richard Cohen",
      "speech": [
        "No, it doesn't change any strategy around BreakPack. BreakPack is designed to handle the slower-moving eaches within a store. This system is actually designed to handle eaches to customers."
      ],
      "session": "question_answer"
    },
    {
      "name": "Operator",
      "speech": [
        "Our next question is a follow-up from Matt Summerville with D.A. Davidson. ."
      ],
      "session": "question_answer"
    },
    {
      "name": "Matt Summerville",
      "speech": [
        "I'm just curious, were you concurrently working on a similar type of solution? And if so, how does this acquisition impact that R&D stream or anything that may or it may not, of course, but that may have been capitalized on the balance sheet? And then I have a follow-up."
      ],
      "session": "question_answer"
    },
    {
      "name": "Carol Hibbard",
      "speech": [
        "And so as Rick mentioned earlier, when we talk R&D, we don't tell you everything we're working on. We're working on multiple developments across different customer requests. So Matt, how you can think about R&D is there are elements of what we'll be working on that are now paid development that you may see some movement on the R&D of what we're currently working on. However, we also have the opportunity, given that this is a paid development program that now we're going to go look at what other R&D we want to continue to be working on. So I think it's a mix."
      ],
      "session": "question_answer"
    },
    {
      "name": "Matt Summerville",
      "speech": [
        "Got it. And then I know you've kind of talked around this a bit, but just to try and clarify, the initial $230 million R&D payment from Walmart when and how does that start to get recognized. Again, can you cover that, please?"
      ],
      "session": "question_answer"
    },
    {
      "name": "Carol Hibbard",
      "speech": [
        "Yes. So we will -- we're working through our final rev rec, and we'll be able to talk a lot more about what that immediate impact is when we guide for the second quarter here in the next few weeks, but we will have revenue and profit associated with that development program that will begin upon the development contract. So that's immediately. What I was referring to is that, that initial cash payment of $230 million, don't expect all of that to immediately convert to revenue in the first year."
      ],
      "session": "question_answer"
    },
    {
      "name": "Operator",
      "speech": [
        "Thank you. And I'm currently showing no further questions at this time. I'd like to hand the call back over to Charlie Anderson for closing remarks."
      ],
      "session": "question_answer"
    },
    {
      "name": "Charlie Anderson",
      "speech": [
        "Well, thank you, everybody, for joining our call this morning. We really appreciate your interest in Symbotic and I look forward to speaking with you again on our upcoming earnings call. Thank you and goodbye."
      ],
      "session": "question_answer"
    },
    {
      "name": "Operator",
      "speech": [
        "This concludes today's conference call. Thank you for your participation. You may now disconnect."
      ],
      "session": "question_answer"
    }
  ],
  "year": 0
}