{
  "id": "GME_3232639",
  "participant": [
    {
      "name": "Matt Furlong",
      "description": "CEO",
      "role": "executive"
    }
  ],
  "quarter": 4,
  "symbol": "GME",
  "time": "2023-03-21 17:01:00",
  "title": "Earnings call Q4 2022",
  "transcript": [
    {
      "name": "Operator",
      "speech": [
        "Good afternoon, and welcome to the GameStop Fourth Quarter and Full Year 2022 Earnings Conference Call. Please note that certain statements made during the call constitute forward-looking statements made pursuant to the safe harbor provisions of the Private Securities Litigation Act of 1995 as amended. Such forward-looking statements are subject to both known and unknown risks and uncertainties that could cause actual results to differ materially from such statements.",
        "These risks and uncertainties are described in the Company's earnings press release and its filings with the SEC. The forward-looking statements today are made as of the date of this call, and the Company does not undertake any obligation to update the forward-looking statements.",
        "I will now turn the call over to GameStop's CEO, Matt Furlong."
      ],
      "session": "management_discussion"
    },
    {
      "name": "Matt Furlong",
      "speech": [
        "Good afternoon to everyone joining today's call.",
        "I want to begin by thanking all of our employees for their dedication and hard work over the past year. Similarly, I want to thank our customers, partners and stockholders for their continued loyalty and enthusiasm. This continued passion was a strong tailwind for us in 2022 as we pivoted to focus on near-term profitability while pursuing longer-term sustainable growth.",
        "Before discussing our initiatives and results in detail, I want to take a moment to shed some light on where we've been, where we are and where we're looking to go. The past two years have obviously been transformative for GameStop. It's critical to provide context as to why we're a stronger and increasingly efficient business today, one that is well positioned in an otherwise challenged retail sector.",
        "At the start of 2021, prior to any major changes to top GameStop, the Company had burdensome debt, dwindling cash, strained relationships with vendors and no meaningful stockholders in the Boardroom. The company's future was very uncertain and market participants predicted we were heading for bankruptcy. Throughout 2021, we refreshed our Board, rebuilt our management team, recapitalized the balance sheet and paid down debt. We also established accretive partnerships, fortified our infrastructure and explored growth opportunities, some of which materialized and some of which did not.",
        "As we began fiscal year 2022, our operating environment dramatically changed due to the onset of inflation, rising interest rates and material macro headwinds. In keeping with our ownership mentality, we considered the implications for GameStop and our stockholders. Rather than standstill, we pivoted last year to cut costs, optimize inventory and focus on enhancing the customer experience. We found efficient ways to improve shipping times, integrate online and in-store shopping experiences and establish a culture of increased incentivization amongst store leaders and tenured associates. This pivot obviously included headcount reductions as we streamlined operations and cultivated a fast-paced intense operating environment geared toward cost containment, efficiency and profitability.",
        "Fortunately, the team we have in place today is embracing this culture and executing with effectiveness. The upshot of all this change is evidenced in our results this quarter. GameStop produced net income of $48.2 million compared to a net loss of $147.5 million in the fourth quarter of 2021.",
        "Looking ahead, we're aggressively focused on year-over-year profitability improvement while still pursuing pragmatic long-term growth. We are taking a number of steps in fiscal year 2023 to improve our efficiency and support these overarching goals. These include continuing to cut excess costs, including in Europe, where we have already initiated exits and partial wind downs in certain countries; leveraging our strengthened financial position to continue obtaining improved terms from suppliers and vendors; getting full console allocations to help us meet customer demand during this extended cycle; assessing partnerships with gaming and retail companies that can enable us to capture cost-effective top line growth; leveraging our unique refurbishment capabilities to drive growth in pre-owned; and building a stronger presence in higher-margin categories like collectibles and toys where we have already seen pockets of growth.",
        "Although there is a lot of hard work and necessary execution in front of us, GameStop is a much healthier business today than it was at the start of 2021. We have considerable cash on hand, negligible debt, streamlined inventory and a path to full year profitability. Our plan is to use this strong positioning to continue delivering a unique customer experience and long-term stockholder value.",
        "Let me now turn to our financial results. Net sales were $2.226 billion for the quarter compared to $2.254 billion in the fourth quarter of 2021. For the full year, net sales were $5.927 billion compared to $6.011 billion for the fiscal year 2021. Net income was $48.2 million for the quarter, or $0.16 per diluted share compared to a net loss of $147.5 million or $0.49 per diluted share in the prior year's fourth quarter. The Company had a net loss of $313.1 million or $1.03 per diluted share for the full year, down from a net loss of $381.3 million or $1.31 per diluted share for fiscal year 2021.",
        "SG&A was $453.4 million or 20.4% of sales compared to $538.9 million or 23.9% of sales in last year's fourth quarter. For the full year, SG&A was $1.68 billion, compared to $1.71 billion for fiscal year 2021.",
        "Turning to the balance sheet. We finished the year with cash, cash equivalents and marketable securities of $1.39 billion. We finished fiscal year 2021 with cash, cash equivalents and marketable securities of $1.27 billion. We built back and invested our cash position over the course of the year, and we'll continue to focus on maintaining a very solid balance sheet. At the end of the year, we had no borrowings under our ABL facility and no debt other than a low interest unsecured term loan associated with the French government's response to COVID-19.",
        "Capital expenditures for the quarter were $11.6 million, bringing full year CapEx to $55.9 million. We expect a reduction in CapEx in 2023 and to remain at limited levels.",
        "In the fourth quarter, cash flow provided by operations was $337.2 million compared to an outflow of $110.3 million during the same period last year. This reflects, in part, our focus on streamlining our inventory. We ended the year with $682.9 million in inventory compared to $915 million at the close of fiscal year 2021.",
        "Entering the new year, we expect to continue to incur transformation charges in the first quarter of 2023 as we aggressively cut costs.",
        "And with respect to an outlook, we're not delivering guidance at this time. We want stockholders to judge us on our results instead of our words.",
        "In closing, there is still significant work ahead of us, and we are focused on building from this quarter's progress rather than reflecting on our gains. We're going to aggressively pursue further cost containment, efficiency, profitability and pragmatic growth in the categories where we can consistently delight our customers.",
        "I'll wrap it up here for today. As always, we appreciate the enthusiasm and support from our customers, employees and stockholders."
      ],
      "session": "management_discussion"
    }
  ],
  "year": 2022
}